[
    [
        "https://whatscooking.fns.usda.gov/recipes/food-distribution-fdd/15-minute-enchiladas",
        "15-Minute Enchiladas",
        "This is quick to make. When you need a main dish right away, try this enchilada recipe. ",
        "8",
        75.0,
        [
            "1. Preheat oven to 350 degrees F.",
            "2. Cover a cookie sheet with foil and spray withnonstick cooking spray.",
            "3. In a medium-size saucepan, heat chili andrefried beans until warm (do not boil).",
            "4. Spoon about half of the chili mixture evenlyonto the tortillas, sprinkle with cheese, ",
            " androll up. Place side by side on the cookiesheet with seam side down.",
            "5. Top tortillas with remaining chili mixture.Sprinkle with remaining cheese.",
            "6. Bake for 10 minutes until cheese is melted."
        ],
        [
            [
                "",
                "nonstick cooking spray"
            ],
            [
                "3 cups",
                "chili without beans (1 can, about 24 ounces)"
            ],
            [
                "1 1/2 cups",
                "canned refried beans, low-sodium, non-fat"
            ],
            [
                "2 cups",
                "low-fat Cheddar or Monterey jack cheese (shredded)"
            ],
            [
                "8",
                "flour tortillas, large size"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/2-step-chicken",
        "2-Step Chicken",
        "The ultimate in simplicity, this recipe calls for chicken and cream of chicken soup. Pair it with a salad, rice dish, or steamed vegetables for a complete dinner. Even better, 2-step around the kitchen while it is heating up, getting some physical activity while you cook!",
        "4",
        25.0,
        [
            "1. Heat oil in a skillet at a medium-high setting.",
            "2. Add chicken and cook for ten minutes.",
            "3. Remove chicken from pan and set aside.",
            "4. Stir the soup and water together in the skillet and heat it to a boil.",
            "5. Return the chicken to the skillet. Reduce the heat to low and simmer for an additional 10 minutes, or until the chicken reaches an internal temperature of 165°F."
        ],
        [
            [
                "1 tablespoon",
                "vegetable oil"
            ],
            [
                "2",
                "Boneless chicken breasts"
            ],
            [
                "1 can",
                "cream of chicken soup (10 ounces)"
            ],
            [
                "1/2 cup",
                "water"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/20-minute-chicken-creole",
        "20-Minute Chicken Creole",
        "This Creole-inspired dish uses chili sauce and cayenne pepper to spice it up. Tomatoes, green pepper, celery, onions and garlic spices also surround the chicken with delicious color. This main dish can be cooked on the stovetop or with an electric skillet.",
        "8",
        50.0,
        [
            "Heat pan over medium-high heat (350 degrees in an electric skillet). Add vegetable oil and chicken and cook until the chicken reaches an internal temperature of 165°F(3-5 minutes).",
            "Reduce heat to medium (300 degrees in electric skillet).",
            "Add tomatoes with juice, chili sauce, green pepper, celery, onion, garlic, basil, parsley, cayenne pepper, and salt.",
            "Bring to a boil; reduce heat to low and simmer, covered for 10-15 minutes.",
            "Serve over hot, cooked rice or whole wheat pasta.",
            "Refrigerate leftovers within 2-3 hours."
        ],
        [
            [
                "1 tablespoon",
                "vegetable oil"
            ],
            [
                "2",
                "chicken breast (whole, skinless, boneless)"
            ],
            [
                "1 can",
                "diced tomatoes (14 1/2 oz., with juice)"
            ],
            [
                "1 cup",
                "chili sauce"
            ],
            [
                "1",
                "green pepper (chopped, large)"
            ],
            [
                "2",
                "celery stalk (chopped)"
            ],
            [
                "1",
                "onion (chopped)"
            ],
            [
                "2",
                "garlic clove (minced)"
            ],
            [
                "1 teaspoon",
                "dried basil"
            ],
            [
                "1 teaspoon",
                "parsley (dried)"
            ],
            [
                "1/4 teaspoon",
                "cayenne pepper"
            ],
            [
                "1/4 teaspoon",
                "salt"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/3-can-chili",
        "3-Can Chili",
        "With almost no cooking required to prepare this chili, just open cans of beans, corn, and tomatoes, and heat everything together in a pan!",
        "6",
        25.0,
        [
            "1) Place the contents of all 3 cans into a pan.",
            "2) Add chili powder to taste.",
            "3) Stir to mix",
            "4) Continue to stir over medium heat until heated thoroughly.",
            "5) Refrigerate leftovers."
        ],
        [
            [
                "1 can",
                "beans, low-sodium undrained (pinto, kidney, red, or black 15.5 ounces)"
            ],
            [
                "1 can",
                "corn, drained (15 ounces, or 10-ounce package of frozen corn)"
            ],
            [
                "1 can",
                "crushed tomatoes, undrained (15 ounces)"
            ],
            [
                "",
                "chili powder (to taste)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/food-distribution-fdd/30-minute-chili",
        "30-Minute Chili",
        "This recipe is quick to make and delicious. Beans are naturally low in fat, free of saturated fat and trans-fat and also a cholesterol-free source of protein.",
        "6",
        50.0,
        [
            "1. In a large skillet, brown the meat for about10 to 15 minutes.",
            "2. Drain the meat; add onion and cook for 5minutes.",
            "3. Add kidney beans, soup, and chili powderand heat for 5 minutes. ",
            " If using hot peppersauce, add that too."
        ],
        [
            [
                "1 pound",
                "ground beef"
            ],
            [
                "1",
                "onion (chopped)"
            ],
            [
                "2 cups",
                "Light red kidney beans  (cooked)"
            ],
            [
                "1 can",
                "tomato soup (no water added)"
            ],
            [
                "1 tablespoon",
                "chili powder (or to taste)"
            ],
            [
                "10 drops",
                "hot pepper sauce (to taste, if you like)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/5-day-bulgur-wheat",
        "5 A Day Bulgur Wheat",
        "Bulgur is the star whole grain of this simple and colorful salad.",
        "8",
        50.0,
        [
            "Wash and chop fresh onion, broccoli, carrots, pepper and parsley (if using fresh parsley).",
            "Heat canola oil in a large skillet. Add onions and cook until soft.",
            "Add bulgur and stir to coat. Add 2 cups chicken broth to the skillet, bring to a boil.",
            "Lower the heat, add remaining vegetables and chickpeas. Cook for 10 minutes or until the liquid is absorbed.",
            "Add parsley and stir. Serve warm or cold."
        ],
        [
            [
                "1",
                "onion (medium, chopped)"
            ],
            [
                "1 cup",
                "broccoli (chopped)"
            ],
            [
                "1 cup",
                "carrot (shredded)"
            ],
            [
                "1",
                "green pepper (small, chopped, - may use red or yellow pepper)"
            ],
            [
                "1/3 cup",
                "fresh parsley (chopped, or 2 Tablespoons dried)"
            ],
            [
                "1 teaspoon",
                "canola oil"
            ],
            [
                "1 1/2 cups",
                "bulgur (dry)"
            ],
            [
                "2 cups",
                "chicken broth (low-sodium)"
            ],
            [
                "8 ounces",
                "chickpeas or garbanzo beans (canned, drained)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/5-day-salad",
        "5 A Day Salad",
        "This nutrient-packed salad uses ten different vegetables, and each serving is equal to five cups of vegetables!",
        "4",
        75.0,
        [
            "1. Wash all of the vegetables and mix them together in a large mixing bowl. Top this colorful meal with the nonfat or low-fat dressing of your choice."
        ],
        [
            [
                "4 cups",
                "spinach (fresh)"
            ],
            [
                "4 cups",
                "romaine lettuce"
            ],
            [
                "2 cups",
                "green pepper (chopped, or use red, yellow, or orange)"
            ],
            [
                "2 cups",
                "cherry tomatoes"
            ],
            [
                "1 cup",
                "broccoli (chopped)"
            ],
            [
                "1 cup",
                "cauliflower (chopped)"
            ],
            [
                "1 cup",
                "yellow squash (sliced)"
            ],
            [
                "2 cups",
                "cucumber (sliced)"
            ],
            [
                "2 cups",
                "carrot (chopped)"
            ],
            [
                "1 cup",
                "zucchini (sliced)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/simple-mexican-salad",
        "A Simple Mexican Salad",
        "Chili powder and lime juice are the secret ingredients in this cucumber and orange salad.",
        "4",
        25.0,
        [
            "1. Wash the cucumbers, oranges and lemon or lime under cold running water.",
            "2. Slice the cucumbers. Peel and cut the oranges into small pieces.",
            "3. Place cucumber slices and orange pieces in a medium size bowl. Add chili powder, lemon or lime juice and salt."
        ],
        [
            [
                "2",
                "cucumbers"
            ],
            [
                "2",
                "oranges"
            ],
            [
                "1",
                "lemon or lime (the juice)"
            ],
            [
                "1/2 teaspoon",
                "chili powder"
            ],
            [
                "1/2 teaspoon",
                "salt"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/alabama-fancy-fish-tacos-2",
        "Alabama Fancy Fish Tacos",
        "“I wanted to make something healthy that gave me energy to play sports,” says Jay. “I play outside a lot after school or I have a ballgame and I wanted something good to fill me up. I’m kind of a picky eater, but I love fish and I knew I wanted it to be the main ingredient. My mom adds vegetables in food that I may not see, so I like these better because they are different colors and I can tell which ones I’m eating!”",
        "4",
        100.0,
        [
            "Preheat the oven to 350°F. On a large baking sheet, place the tilapia, and add salt to taste (if frozen, defrost the fish first). Bake for 25 minutes, or until the fish flakes easily with a fork.",
            "Meanwhile, in a medium pot, bring 2 cups of water and the quinoa to a boil over medium heat; reduce heat to low and cook for about 20 minutes, or until tender.",
            "In a large bowl, combine the vegetables and cilantro. When the fish is done, squeeze lime juice over each fillet. Fill each whole-wheat tortilla with fish and about ¼ cup vegetables. Roll up and serve."
        ],
        [
            [
                "4",
                "fresh or frozen tilapia fillets"
            ],
            [
                "",
                "Salt to taste"
            ],
            [
                "1 cup",
                "quinoa, rinsed"
            ],
            [
                "1",
                "large carrot, peeled and thinly sliced"
            ],
            [
                "1",
                "large cucumber, thinly sliced"
            ],
            [
                "1/2 cup",
                "red cabbage"
            ],
            [
                "1 cup",
                "broccoli, chopped"
            ],
            [
                "1/4 cup",
                "fresh cilantro"
            ],
            [
                "1",
                "juice of 1 lime"
            ],
            [
                "4",
                "whole-wheat tortillas or wraps"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/alaskan-ceviche-mango",
        "Alaskan Ceviche with Mango",
        "\"I came up with this because it's a dish that has mostly fresh fruits and vegetables. It also has Alaskan fish and Alaskan spot prawns, which is the best seafood in the world. These are all things that I like,\" says Rowan. \"I would put whole-grain tortilla chips and low-fat milk to balance it out for a healthy meal.\"",
        "6",
        100.0,
        [
            "1. In a medium saucepan over moderate heat, bring the grapefruit juice to a boil.",
            "2. Add the rockfish and prawns, reduce the heat to a simmer, and poach the fish and prawns until just tender, about 3 minutes.",
            "3. Transfer the fish and prawns to a non-aluminum bowl, cover, and chill in the refrigerator up to 3 hours.",
            "4. In a large bowl, toss together the tomatoes, mango, cilantro, and onion.",
            "5. Add the lime, lemon, and orange juices, the jalapeño or serrano chile, if using, and salt.",
            "6. Add the chilled seafood, stir to combine, and taste to see if you want to add more salt, citrus, or spiciness.",
            "7. Serve immediately or chill up to 2 hours for later use."
        ],
        [
            [
                "1/2 cup",
                "fresh grapefruit juice"
            ],
            [
                "1 pound",
                "Alaskan rockfish fillets or any white, firm, fish (1-2 fillets, skin removed, chopped into bite-sized pieces)"
            ],
            [
                "10",
                "Alaskan spot prawns or large shrimp (peeled, cleaned, and tails removed, then cut into bite-sized pieces)"
            ],
            [
                "6",
                "plum tomatoes (chopped)"
            ],
            [
                "1",
                "mango (peeled and chopped)"
            ],
            [
                "3/4 cup",
                "chopped fresh cilantro leaves"
            ],
            [
                "1/2 cup",
                "chopped white onion"
            ],
            [
                "1/2 cup",
                "freshly squeezed lime juice"
            ],
            [
                "1/4 cup",
                "freshly squeezed lemon juice"
            ],
            [
                "1/4 cup",
                "freshly squeezed orange juice"
            ],
            [
                "1 teaspoon",
                "minced jalapeño or serrano chile (optional)"
            ],
            [
                "1 teaspoon",
                "Kosher salt"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/alexandras-refreshing-watermelon-salad",
        "Alexandra's Refreshing Watermelon Salad",
        "“Alexandra was given a gift of a cast iron skillet,” says Alexandra’s mom, Brianna. “Upon the realization that anything is possible with cooking and understanding the limitless potential of creating healthy foods that are fulfilling to the senses and the soul, she has expanded her cooking talents to include the artistic, nutritious creation of salads! Alexandra's salad was created the day that her grandmother gave her a fresh watermelon. She quickly got busy creating this tantalizing salad that got rave reviews from her family!”",
        "4",
        25.0,
        [
            "1. In a large salad bowl, mix all ingredients together. Arrange the salad mixture on a platter and serve with whole-­grain dinner rolls spread with grass-fed butter, if possible. ENJOY!!!"
        ],
        [
            [
                "1 cup",
                "fresh spring greens"
            ],
            [
                "1 cup",
                "fresh cilantro"
            ],
            [
                "1 cup",
                "fresh watermelon, cubed"
            ],
            [
                "1/2 cup",
                "red grapes, halved"
            ],
            [
                "1/4 cup",
                "walnuts, chopped"
            ],
            [
                "1/4 cup",
                "Feta cheese"
            ],
            [
                "4",
                "whole-grain dinner rolls"
            ],
            [
                "2 teaspoons",
                "butter"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/all-kale-caesar",
        "All Kale Caesar!",
        "“This recipe is for hungry kids who like salad and want to make it a meal,” says Hannah. “In this recipe, I’ve added protein (salmon) and a heartier base (kale) to turn one of my favorite dishes into a satisfying meal. Every year my grandma serves Caesar salad as a starter on Christmas Eve. I request Caesar salads for my special meals and as I’ve grown, I make the salad myself. I was inspired to create All Kale Caesar so that my favorite salad wasn’t just a side dish—it’s a satisfying meal. I hope you enjoy this salad as much as I do!”",
        "4",
        100.0,
        [
            "Preheat the oven to 275°F. In a large bowl, combine bread cubes with 2 tablespoons of olive oil, salt, and pepper. Bake for 15 minutes or until golden and dry.",
            "Meanwhile, season the salmon with salt and pepper. In a nonstick skillet, warm 1 tablespoon of olive oil over medium heat, add the salmon skin-­‐‑side down and cook for 5 minutes, turn over and cook 2 minutes more, or until salmon is firm. Remove skin.",
            "In a large salad bowl, add the kale. Place the whole uncracked egg into a cup with hot water and let sit for 5 minutes. In a small bowl, whisk together remaining ¼ cup olive oil, Worcestershire sauce, lemon juice, salt, and pepper. Crack the egg into the dressing and whisk until combined. Add the dressing to the kale and massage in so that the kale is well coated. Flake the salmon and add to the kale along with Parmesan, olives, and croutons. Toss well to combine."
        ],
        [
            [
                "4 slices",
                "whole-wheat bread, cut into ½-inch cubes"
            ],
            [
                "1/4 cup",
                "olive oil, plus 3 tablespoons"
            ],
            [
                "1/2 teaspoon",
                "salt, truffle flavor or regular"
            ],
            [
                "8 ounces",
                "salmon fillets"
            ],
            [
                "5 cups",
                "kale, stems removed, cut into bite-sized pieces  (about 1 head)"
            ],
            [
                "1 tablespoon",
                "Worcestershire sauce"
            ],
            [
                "1/2",
                "lemon, juiced"
            ],
            [
                "2 tablespoons",
                "grated Parmesan cheese"
            ],
            [
                "1/4 cup",
                "chopped black olives"
            ],
            [
                "1",
                "egg"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/ambrosia",
        "Ambrosia",
        "This dessert features fresh fruit, yogurt, and coconut, with a dash of marshmallows for fun. No cooking is required. ",
        "8",
        50.0,
        [
            "1. Drain pineapple and oranges. Use juice as beverage.",
            "2. Combine fruit with marshmallows and coconut.",
            "3. Fold in yogurt.",
            "4. Chill.",
            "5. Serve."
        ],
        [
            [
                "1 can",
                "pineapple chunks (in juice, 20 oz., drained)"
            ],
            [
                "1 1/3 cups",
                "mandarin orange (drained)"
            ],
            [
                "1",
                "banana (peeled and sliced)"
            ],
            [
                "1 1/2 cups",
                "grape (seedless)"
            ],
            [
                "3/4 cup",
                "marshmallows (miniature)"
            ],
            [
                "1/3 cup",
                "coconut (flaked)"
            ],
            [
                "1 cup",
                "vanilla yogurt, low-fat (8 ounces)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/american-flag-ravioli-creamy-garden-sauce",
        "American Flag Ravioli in Creamy Garden Sauce",
        "“I saw a cool way to put designs into pasta and thought I could try to make red stripes for the American Flag,” says Daniela. “My favorite parts of making this were when I made the nest in the flour to hold the ingredients. I loved mixing the beet dough and seeing the red color pop out! I also really liked to turn the pasta crank. My dad grinds all of our flour. We grow a lot of vegetables used to make the garden sauce for the ravioli.”",
        "6",
        100.0,
        [
            "To make the Whole-Wheat Dough: In a large mixing bowl, combine the two flours. Form a hole or nest in the flour and add eggs, oil and salt; stir to mix. Add a bit of flour or water, if needed, to form a dough. Separate the dough into two equal pieces and feed into the pasta maker to form a long, thin sheet of pasta dough. Or, flatten the dough with a rolling pin into a sheet, ¼-inch thick or less.",
            "To make the Red Flag-­Stripe Dough: In a medium saucepan filled with cold water, boil beets over medium-­high heat, about 5 minutes, or until soft. In a blender, combine the beets with ¼ cup of the beet water, and blend into a puree. In a large mixing bowl, combine the flours. Form a hole or nest in the flour and add beet puree, eggs, oil, salt; stir to mix. Add a bit of flour or water, if needed, to form a dough. Separate the dough into two equal pieces and feed into the pasta maker to form long, thin pasta strands, like spaghetti noodles. Or, flatten the dough with a rolling pin into a sheet, ¼-inch thick or less and use a knife to make skinny long strips. Lay the red dough strips on top of the sheets of whole-­wheat dough, ½-inch apart in a stripe pattern, and press into pasta. Lay it flat.",
            "To make the Sauce: Toss all the sauce ingredients into a crockpot on low heat for 10 hours or more. Or, in a large stockpot, warm olive oil over medium heat, cook the garlic for 2 minutes, then add the remaining ingredients, cover, reduce heat to low, and simmer for 20 minutes until slightly thickened.",
            "To make the Filling: In a large nonstick skillet, warm the olive oil over medium heat, add the onions, garlic, and shrimp, and cook for 6 minutes or until the shrimp is pink and cooked through. Add the parsley and ricotta cheese and mix well. Salt to taste.",
            "To Assemble: Place ½ tablespoon of filling on the overturned, flat dough sheet about ½-­inch apart. Brush beaten egg around the mounds of filling. Place the other flat sheet of dough on top of the mounds, so that the stripes are facing up. Press a very small cup, bowl, or cookie cutter around each mound of dough and filling to create a cut-out ravioli. Use the extra dough to make more raviolis. Seal the dough edges with a fork. In a large stockpot of boiling salted water, drop 10 ravioli in at a time, and cook over medium heat, for 6 minutes, or until they are completely cooked and float up to the top. On each plate, combine 5 ravioli with ¼ cup of tomato sauce and serve."
        ],
        [
            [
                "1 cup",
                "whole-wheat flour"
            ],
            [
                "1 cup",
                "9-grain flour  (or you can substitute all-purpose or semolina)"
            ],
            [
                "2",
                "eggs, beaten"
            ],
            [
                "2 teaspoons",
                "olive oil"
            ],
            [
                "1/4 teaspoon",
                "salt"
            ],
            [
                "1",
                "egg, beaten, for sealing"
            ],
            [
                "1/2",
                "beet, peeled, halved, and quartered"
            ],
            [
                "1/2 cup",
                "whole-wheat flour"
            ],
            [
                "1/2 cup",
                "9-grain flour  (or you can substitute all-purpose or semolina)"
            ],
            [
                "1",
                "egg, beaten"
            ],
            [
                "1 teaspoon",
                "olive oil"
            ],
            [
                "1/8 teaspoon",
                "salt"
            ],
            [
                "1 tablespoon",
                "olive oil"
            ],
            [
                "2",
                "garlic cloves, peeled and minced"
            ],
            [
                "8",
                "tomatoes, seeded and chopped"
            ],
            [
                "1",
                "squash, peeled and chopped"
            ],
            [
                "1",
                "zucchini, peeled and chopped"
            ],
            [
                "",
                "Sprig of fresh oregano or ¼ teaspoon dried"
            ],
            [
                "2",
                "sprigs of thyme or ½ teaspoon dried"
            ],
            [
                "",
                "Sprig of rosemary or ¼ teaspoon dried"
            ],
            [
                "1 tablespoon",
                "agave"
            ],
            [
                "1/3 cup",
                "heavy cream"
            ],
            [
                "1 tablespoon",
                "olive oil"
            ],
            [
                "1/2",
                "onion, peeled and diced"
            ],
            [
                "1",
                "garlic clove, peeled and minced"
            ],
            [
                "2 cups",
                "shrimp, peeled, tails removed, finely chopped"
            ],
            [
                "1 tablespoon",
                "dried parsley"
            ],
            [
                "1/4 cup",
                "ricotta cheese"
            ],
            [
                "",
                "For the Whole-Wheat Dough:"
            ],
            [
                "",
                "For the Red Flag Stripe Dough:"
            ],
            [
                "",
                "Water if needed, to form dough"
            ],
            [
                "",
                "For the Sauce:"
            ],
            [
                "",
                "For the Filling:"
            ],
            [
                "",
                "Salt"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/american-gothic-calzones",
        "American Gothic Calzones",
        "“My goal is to be a veterinarian and because I love animals and healthy food, I enjoy inventing recipes that are plant based,” says Lola. “Iowa is known for Grant Wood's painting American Gothic. My calzones include Iowa grown ingredients. During World War I, when Hoover was appointed U.S. Food Administrator, his slogan was ‘Food Will Win the War.’ In order to feed our American army overseas, his food conservation campaign successfully reduced domestic food consumption by 15 percent. With my calzones, I serve a ‘Food Will Win the War’ vegetable medley. Applying Hoover's ‘Food Will Win the War’ approach to obesity, I vow to be part of the solution.” Lola’s Go Ride Your Bike dessert has cantaloupe, bananas, and other fruits.",
        "6",
        75.0,
        [
            "1. To make the Spinach Filling: In a blender, combine water and cashew pieces. Blend on high for 1 minute until smooth. Pour into a medium bowl. Add tofu, salt, garlic powder, Italian seasoning, lemon juice, and spinach and mix well.",
            "2. To make the Calzones: Preheat the oven to 425°F. In a large mixing bowl, combine water and yeast. Let sit for 5 minutes. Add applesauce, honey, salt, and flour and stir well to combine. (You can also use a stand mixer or a food processor.) When dough forms a ball, knead it for 2 minutes on a work surface sprinkled with flour. Divide the bread dough into 6 equal pieces and roll into balls. Flatten dough with a rolling pin to 1/8-­inch thickness. Divide the filling among the circles. Lift the edge and stretch the dough over to the opposite edge, enclosing filling, and pressing the edge of the dough gently to seal. Arrange calzones seam-side down on a large baking sheet lined with parchment paper, and bake for 15 minutes or until golden brown.",
            "3. To make Food Will Win the War Medley: In a medium saucepan, warm the oil over medium heat. Combine all ingredients, heat for about 15 minutes, until heated through. Serve with American Gothic Calzones."
        ],
        [
            [
                "1/2 cup",
                "water"
            ],
            [
                "1/2 cup",
                "raw unsalted cashew pieces"
            ],
            [
                "8 ounces",
                "firm tofu, crumbled"
            ],
            [
                "1 teaspoon",
                "garlic powder"
            ],
            [
                "1 teaspoon",
                "Italian seasoning"
            ],
            [
                "1 teaspoon",
                "fresh lemon juice"
            ],
            [
                "5 ounces",
                "chopped fresh spinach"
            ],
            [
                "1 1/4 cups",
                "warm water"
            ],
            [
                "1 package",
                "active dry yeast"
            ],
            [
                "2 tablespoons",
                "unsweetened applesauce"
            ],
            [
                "2 tablespoons",
                "honey"
            ],
            [
                "1 teaspoon",
                "salt"
            ],
            [
                "2 1/2 cups",
                "whole-wheat flour"
            ],
            [
                "1 tablespoon",
                "olive oil"
            ],
            [
                "1",
                "15-ounce can corn"
            ],
            [
                "1",
                "15-ounce can lima beans (you can substitute with chickpeas)"
            ],
            [
                "1",
                "15-ounce can hominy"
            ],
            [
                "1/4 cup",
                "diced red bell pepper"
            ],
            [
                "1/2 cup",
                "diced green bell pepper"
            ],
            [
                "",
                "For the Spinach Filling:"
            ],
            [
                "",
                "Dash to 1 teaspoon salt"
            ],
            [
                "",
                "For the Calzones:"
            ],
            [
                "",
                "For the ‘Food Will Win the War’ Medley:"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/angel-food-cake",
        "Angel Food Cake",
        "This recipe gives clear and easy instructions for making the classic, fluffy cake.",
        "12",
        25.0,
        [
            "1. Preheat the oven to 325°F. In a large mixing bowl, beat the egg whites until they are foamy.2. Add the cream of tartar and beat until stiff, but not dry. Gradually beat in the sugar3. Add the vanilla and salt and then gently fold in the flour.4. Pour the mix into an angel food tubular pan and bake for 1 hour and 15 minutes, or until the top is nicely browned."
        ],
        [
            [
                "12",
                "egg whites (1 1/2 cups)"
            ],
            [
                "1 teaspoon",
                "cream of tartar"
            ],
            [
                "1 1/2 cups",
                "sugar"
            ],
            [
                "1 teaspoon",
                "vanilla extract"
            ],
            [
                "1/4 teaspoon",
                "salt"
            ],
            [
                "1 cup",
                "flour (sifted)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/angel-food-pastry-fresh-berries-and-whipped",
        "Angel Food Pastry with Fresh Berries and Whipped Cream",
        "Light and fluffy angel food cake is mixed with yogurt and a sprinkle of berries on top.",
        "1",
        25.0,
        [
            "1. Scoop 3 Tablespoons of angel food cake mix into a microwave-safe cup or mug.",
            "2. Add 2 Tablespoons of vanilla yogurt and stir.",
            "3. Place in the center of the microwave oven and microwave for 1 minute.",
            "4. Take out of microwave and let cool for 1 minute.",
            "5. Using a knife, cut around the sides of the cup to loosen the cake and \"dump\" it on a plate.",
            "6. Dole 1 Tablespoon of whipped topping on top of the cake.",
            "7. Sprinkle raspberries around the angel cake and add sliced strawberries to top.",
            "8. Enjoy."
        ],
        [
            [
                "1 ounce",
                "angel food cake mix (3 tablespoons)"
            ],
            [
                "1/8 cup",
                "yogurt, low-fat vanilla (2 Tablespoons)"
            ],
            [
                "1/8 cup",
                "raspberries (about 3 )"
            ],
            [
                "2",
                "strawberries, sliced"
            ],
            [
                "1 1/2 tablespoons",
                "lite whipped topping (can use 1-2 Tablespoons)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/any-days-picnic-chicken-salad",
        "Any Days a Picnic Chicken Salad",
        "Onion and pickle relish spice up a traditional chicken salad.",
        "6",
        25.0,
        [
            "1. Combine all ingredients.",
            "2. Refrigerate until ready to serve.",
            "3. Use within 1-2 days. Chicken salad does not freeze well.",
            "How to use:",
            "1. Make chicken salad sandwiches.",
            "2. Make a pasta salad by mixing with 2 cups cooked pasta.",
            "3. Kids will love this salad served in a tomato or a cucumber boat."
        ],
        [
            [
                "2 1/2 cups",
                "chicken breast (cooked, diced)"
            ],
            [
                "1/2 cup",
                "celery (chopped)"
            ],
            [
                "1/4 cup",
                "onion (chopped)"
            ],
            [
                "3 packages",
                "pickle relish (2/3 tablespoon)"
            ],
            [
                "1/2 cup",
                "mayonnaise (light)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/supplemental-nutrition-assistance-program-snap/anytime-pizza",
        "Anytime Pizza",
        "Make your own pizza topped with green peppers, mushrooms, or other vegetables.",
        "2",
        25.0,
        [
            "1. Toast the bread or English muffin until slightly brown.",
            "2. Top bread or muffin with pizza sauce, vegetables and low-fat cheese.",
            "3. Sprinkle with Italian seasonings as desired.",
            "4. Return bread to toaster oven (or regular oven preheated to 350 degrees).",
            "5. Heat until cheese melts."
        ],
        [
            [
                "1/4",
                "mini baguette or Italian bread (split lengthwise, or 2 split English muffins)"
            ],
            [
                "1/2 cup",
                "pizza sauce"
            ],
            [
                "1/2 cup",
                "mozzarella or cheddar cheese (part-skim, shredded)"
            ],
            [
                "1/4 cup",
                "green pepper (chopped)"
            ],
            [
                "1/4 cup",
                "mushrooms (fresh or canned, sliced)"
            ],
            [
                "",
                "vegetable toppings (other, as desired, optional)"
            ],
            [
                "",
                "Italian seasoning (optional)"
            ]
        ]
    ],
    [
        "https://whatscooking.fns.usda.gov/recipes/myplate-cnpp/apple-chicken-salad",
        "Apple & Chicken Salad",
        "A deliciously balanced blend of crisp Cameo apples, celery, raisins, chicken breast and Greek yogurt-based dressing, served over a bed of lettuce.",
        "4",
        50.0,
        [
            "Cut apples in quarters; remove core and chop.",
            "In a medium size bowl, mix all ingredients, except lettuce.",
            "To serve, arrange lettuce on serving plates top with apple and chicken salad."
        ],
        [
            [
                "2",
                "red apples (such as Cameo Apples)"
            ],
            [
                "2",
                "celery stalks (diced)"
            ],
            [
                "2",
                "chicken breasts (skinless, cooked, diced, about 2 cups)"
            ],
            [
                "1/4 cup",
                "plain non-fat Greek yogurt"
            ],
            [
                "1/2 cup",
                "raisins"
            ],
            [
                "1/4 cup",
                "mayonnaise"
            ],
            [
                "1/4 teaspoon",
                "salt"
            ],
            [
                "1/8 teaspoon",
                "ground black pepper"
            ],
            [
                "16",
                "lettuce leaves (Bibb, Romaine, green or red leaf)"
            ]
        ]
    ]
]