[
    [
        "Ultimate Chili-Stuffed Sweet Potato Skins",
        "Delicious chili stuffed sweet potato skins that make the perfect game day appetizer or easy vegetarian lunch! Topped with melted cheese and a scoop of honey-lime chipotle yogurt sauce. This recipe is sponsored byBUSH’S® Beans.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F. Line a large baking sheet with parchment paper. Use a fork to poke several holes all over sweet potatoes. Place on prepared baking sheet. Bake for 1 hour or until easily pierced with a fork. Allow sweet potatoes to cool for 10-15 minutes. Turn up heat in oven to 425 degrees F.While the sweet potatoes are cooling, make the honey-lime chipotle yogurt sauce: In a small bowl mix together the yogurt, honey, lime juice and chipotle chili powder. Taste and adjust seasonings, adding more chili powder if you like things a little spicy. Place in fridge until ready to use.After sweet potatoes have cooled off, cut them in half lengthwise. Scoop out the inside flesh, leaving a thin layer flesh on sides and bottom of the sweet potato. Remember, it’s very important that you don’t scoop it all out or you won’t be able to fill the sweet potatoes up. You can use the leftover flesh for adding to smoothies or making muffins, pancakes or pie. Brush the inside and outsides of sweet potato with olive oil and sprinkle with a little salt. Bake in oven for 10-15 minutes to crisp up the outsides.Divide BUSH’S® Chili Beans evenly between sweet potatoes. Sprinkle cheese on top. Bake for 5 minutes or until cheese is melted. Add a little of the yogurt sauce on top, then garnish with green onion, jalapeño slices and cilantro. Best if enjoyed immediately, but will stay good if properly covered in fridge for up to 5-7 days. Serves 6."
        ],
        [
            [
                "",
                "3 medium-large sweet potato skins (about 3 inches in diameter and 5-6 inches long)"
            ],
            [
                "",
                "1/2 tablespoon olive oil"
            ],
            [
                "",
                "Salt"
            ],
            [
                "",
                "1 (15 ounce) can BUSH’S® Kidney Beans in a Mild Chili Sauce"
            ],
            [
                "",
                "½ cup shredded colby jack or mexican cheese"
            ],
            [
                "",
                "¼ cup plain greek yogurt or sour cream"
            ],
            [
                "",
                "1 teaspoon honey"
            ],
            [
                "",
                "½ lime, juiced"
            ],
            [
                "",
                "¼ teaspoon chipotle chili powder, plus more to taste"
            ],
            [
                "",
                "1 green onion, diced"
            ],
            [
                "",
                "Jalapeno slices"
            ],
            [
                "",
                "1 tablespoon fresh chopped cilantro"
            ],
            [
                "",
                "Chopped cooked bacon, if you’re feeling fancy"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Fresh & Healthy 7-Layer Dip",
        "The BEST healthy 7-layer dip ever made with beans, yogurt, taco seasoning, guacamole, cheese, tomatoes, black olives, onion, cilantro and jalapeños. Fresh, flavorful and absolutely delicious! Always a crowd-pleaser for game day and even holiday parties. This recipe is sponsored by siggi’s.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Spread refried beans all over the bottom of a 9x9 inch pan.In a medium bowl, mix together the yogurt and packet of taco seasoning (or DIY taco seasoning). Spread on top of refried beans.In a separate medium bowl, mash avocados with a fork until a mix between smooth and chunky. Stir in cilantro, jalapeno, lime juice and add salt and pepper to taste. Spread on top of yogurt.Finally, add remaining layers in the following order: shredded cheese, quartered grape tomatoes, sliced black olives, diced onion, cilantro and a few jalapeno slices. Cover and refrigerate until ready to serve. Recipe be can be made 24 hours in advance, but is best to make the day of! Serves 10. Serve with tortilla chips, plantain chips, pita chips, carrot sticks, celery or cucumber slices."
        ],
        [
            [
                "",
                "1 (15 ounce) can refried beans (use vegetarian refried beans if you are vegetarian)"
            ],
            [
                "",
                "For the taco layer:"
            ],
            [
                "",
                "3 5.3 oz containers or 2 cups from a 24oz tub of Plain siggi’s skyr"
            ],
            [
                "",
                "1 (1 ounce) packet of taco seasoning*"
            ],
            [
                "",
                "For the guacamole layer:"
            ],
            [
                "",
                "2 medium avocados"
            ],
            [
                "",
                "2-3 tablespoons chopped cilantro"
            ],
            [
                "",
                "1 jalapeño, seeded and diced"
            ],
            [
                "",
                "½ lime, juiced"
            ],
            [
                "",
                "Salt & pepper to taste"
            ],
            [
                "",
                "Remaining layers:"
            ],
            [
                "",
                "½ cup shredded cheddar or mexican cheese"
            ],
            [
                "",
                "1 ½ cups quartered grape tomatoes"
            ],
            [
                "",
                "¼ cup sliced black olives"
            ],
            [
                "",
                "2 tablespoons finely diced red onion or green onion"
            ],
            [
                "",
                "½ cup chopped fresh cilantro"
            ],
            [
                "",
                "Optional: jalapeno slices"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Vegan Potato Salad with Herbed Tahini Sauce",
        "Creamy no mayo added vegan potato salad coated with a beautiful green herbed tahini sauce made with tahini, fresh herbs, almondmilk, lemon and Dijon! A gorgeous and delicious take on traditional potato salad! This recipe is in partnership with Almond Breeze.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place potatoes in a large pot filled with water and 1 teaspoon salt and bring to a boil over high heat. Reduce heat to medium then boil for 10-13 minutes or until you can easily insert a knife into a potato.While the potatoes are boiling, make the tahini sauce: Add tahini sauce, lemon juice, almondmilk, garlic, dijon mustard, parsley, cilantro, dill, salt and pepper to a blender, and blend until smoothe and creamy. Taste and then add more salt and pepper, if necessary.When the potatoes are ready, drain them, transfer to a bowl and place them in the fridge for 1 hour or until completely cool.Once potatoes are cooled, slice them into ½ inch rounds and place in a bowl or on a large serving platter. Add green onions. Drizzle or toss with tahini dressing (I like to drizzle for presentation purposes.)Garnish with extra green onions and chopped dill. Serves 6-8."
        ],
        [
            [
                "",
                "¾ pound red potatoes"
            ],
            [
                "",
                "¾ pound purple potatoes"
            ],
            [
                "",
                "¾ pound yellow gold potatoes"
            ],
            [
                "",
                "*please note you can do a mix of any of these potatoes"
            ],
            [
                "",
                "½ cup diced green onions"
            ],
            [
                "",
                "⅓ cup tahini sauce"
            ],
            [
                "",
                "2 tablespoons fresh lemon juice"
            ],
            [
                "",
                "2-4 tablespoons Almond Breeze Almond Cashew Unsweetened Vanilla, to thin"
            ],
            [
                "",
                "1 clove garlic"
            ],
            [
                "",
                "1/2 teaspoon dijon mustard"
            ],
            [
                "",
                "⅓ cup chopped fresh Italian parsley"
            ],
            [
                "",
                "⅓ cup chopped fresh cilantro"
            ],
            [
                "",
                "1 tablespoon chopped fresh dill"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        [
            "Appetizer",
            " Side Dish",
            " Vegan",
            " Vegetarian"
        ]
    ],
    [
        "Peach, Goat Cheese & Basil Wonton Bites",
        "Juicy fresh peaches, creamy goat cheese and a balsamic reduction piled on a delicious baked wonton bites. The perfect summer appetizer ready in about 15 minutes! This recipe is in partnership with Nasoya.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 350 degrees F.While your oven preheats, place wonton wrapper halves evenly on a baking tray, spray with nonstick cooking spray and sprinkle with sea salt. Bake for 7-8 minutes or until golden brown.Next make your balsamic reduction: Add balsamic vinegar and sugar to a small saucepan and place over medium high heat. Bring mixture to a boil, then reduce to medium low and simmer for 15-20 minutes, stirring every so often until the balsamic vinegar turns into a thick syrup like consistency.Once your balsamic has been reduced by half (or to a syrup like consistency), remove from heat and set aside. Note: if the mixture hardens up after removing from heat, just reheat it over a low heat.After your wonton wrappers have cooled, spread each triangle with about ½ tablespoon of goat cheese and add about 1 tablespoon of diced peaches.Drizzle with your balsamic reduction then garnish with basil ribbons. Serve immediately. Serves 9, 4 wonton bites triangles per person."
        ],
        [
            [
                "",
                "18 Nasoya Won Ton Wraps, cut in half diagonally"
            ],
            [
                "",
                "2 medium yellow peaches, diced"
            ],
            [
                "",
                "4 ounces goat cheese log"
            ],
            [
                "",
                "8 basil leaves, julienned"
            ],
            [
                "",
                "Nonstick cooking spray"
            ],
            [
                "",
                "Sea salt"
            ],
            [
                "",
                "For the balsamic reduction:"
            ],
            [
                "",
                "¾ cup balsamic vinegar"
            ],
            [
                "",
                "1 tablespoon coconut sugar (any sugar will work)"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Jalapeño-Goat Cheese Grilled Stuffed Mini Peppers",
        "Grilled stuffed mini peppers that are both easy and delicious. This vegetarian appetizer is made with only 3 ingredients — goat cheese, jalapeñosand mini peppers!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat grill to medium high heat or about 400 degrees F. Oil the grates, then place peppers cut side up and grill for about 4-5 minutes per side until they have soften and have nice grill marks. Remove from grill.In a medium bowl, mix together the goat cheese and diced jalapeño. Stuff each pepper half with the jalapeño-goat cheese mixture. Serve immediately. Serves 8, about 4 pepper halves each."
        ],
        [
            [
                "",
                "1 pound mini sweet bell peppers, halved and seeds removed"
            ],
            [
                "",
                "6-8 ounces goat cheese log"
            ],
            [
                "",
                "1 jalapeño, finely chopped (seeds removed if you don’t like them spicy!)"
            ]
        ],
        [
            "Appetizer",
            " Vegetarian"
        ]
    ],
    [
        "Spicy Maple Dijon Grilled Brussels Sprouts",
        "Spicy maple grilled brussels sprouts are the most delicious side dish. The brussels sprouts get caramelized, slightly charred on the outside and are full of sweet and spicy flavor.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat grill to medium high heat (about 400 degrees F) and lightly oil the grate.Cut off the stem of the brussels sprouts (just the white part on the bottom) and remove any outer yellow leaves. Be very careful not to cut too much off the stem, otherwise the leaves will all fall off!Place brussels sprouts in a large bowl.In a small bowl, whisk together the olive oil, maple syrup, dijon, garlic, cayenne, salt and pepper. Pour all over the brussel sprouts and toss until they’re full coated.Skewer 4-5 brussels onto each skewer. Reserve extra sauce in the bottom of the bowl.Place skewers on grill, cooking for about 5-7 minutes per side, or until brussels sprouts are golden brown and slightly charred. Before serving, brush brussels with any remaining sauce and sprinkle with a little extra salt, if desired. Serves 4."
        ],
        [
            [
                "",
                "1 pound brussels sprouts"
            ],
            [
                "",
                "2 tablespoons olive oil"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "1-2 tablespoons dijon mustard"
            ],
            [
                "",
                "2 cloves garlic, finely minced"
            ],
            [
                "",
                "½ teaspoon cayenne pepper"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        []
    ],
    [
        "Best Healthy Coleslaw Ever (no mayo!)",
        "The BEST healthy coleslaw made with fresh purple cabbage, carrots, cilantro, and a kick of heat from jalapeño. There’s no mayo, just a naturally sweet and slightly tangy dressing. This simple, healthy coleslaw is perfect serving with your favorite grilling recipes all summer!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all the ingredients for the slaw except for the almonds and sunflower seeds to a large bowl.In a small bowl, whisk together all the ingredients for the dressing. Pour all over the slaw and toss well to combine. Taste and adjust seasonings as necessary. Cover and place in fridge for at least an hour to allow flavors to marinate together.Before serving, sprinkle with toasted sliced almonds and sunflower seeds or pepitas; toss again and serve."
        ],
        [
            [
                "",
                "1 medium head of purple cabbage, shredded"
            ],
            [
                "",
                "2 heaping cups shredded carrots"
            ],
            [
                "",
                "¾ cup finely chopped cilantro"
            ],
            [
                "",
                "1 jalapeños, seeded and finely diced"
            ],
            [
                "",
                "Optional: ½ cup diced scallions (the green part only of the green onion)"
            ],
            [
                "",
                "½ cup toasted sliced almonds (or sub chopped roasted almonds)"
            ],
            [
                "",
                "1/4 cup roasted sunflower seeds or pepitas"
            ],
            [
                "",
                "2 tablespoons extra virgin olive oil"
            ],
            [
                "",
                "2 tablespoons apple cider vinegar"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "1 clove garlic, minced"
            ],
            [
                "",
                "¼ teaspoon cayenne pepper"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly cracked black pepper"
            ]
        ],
        [
            "Appetizer",
            " Side Dish",
            " Vegetarian"
        ]
    ],
    [
        "Avocado Strawberry Mango Salsa",
        "Bright and flavorful Avocado Strawberry Mango Salsa for dipping chips or adding to salads, tacos, fish, or chicken! This new take on salsa has hints of sweetness from fresh strawberries and mango, creaminess from avocado, and a kick of heat from jalapeño. It takes just 15 minutes to make and is perfect for parties!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place all ingredients in a medium bowl and mix to combine. Garnish with extra cilantro. Serve with pita chips for dipping. Also great served on salmon, fish tacos or shrimp. Serves 4-6. Double the recipe to serve 10-12."
        ],
        [
            [
                "",
                "1 cup diced strawberries (a little more than a half pound of strawberries)"
            ],
            [
                "",
                "1 cup diced ripe mango (from 2 large mangoes)"
            ],
            [
                "",
                "1 avocado, diced"
            ],
            [
                "",
                "1 jalapeno, seeded and diced"
            ],
            [
                "",
                "2 tablespoons finely diced red onion"
            ],
            [
                "",
                "2-3 tablespoons diced cilantro"
            ],
            [
                "",
                "1 small lime, juiced"
            ],
            [
                "",
                "1/4 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "Multigrain pita chips, for serving/dipping"
            ]
        ],
        [
            "Appetizer",
            " Summer"
        ]
    ],
    [
        "31 Recipes for your Memorial Day Menu",
        "31 delicious Memorial Day recipes that are perfect for your holiday weekend menu! Skip the store-bought platters and bring these fun appetizers, flavorful grilling recipes, bright salads, and homemade sweets to your parties and potlucks. These recipes are guaranteed to impress guests!",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "17 Healthy Side Dish Recipes to Pair with Any Meal",
        "Sometimes the simplest recipes I make end up being my absolute favorites. To me there’s nothing better than a few fresh ingredients and a killer seasoning or sauce, especially when it comes to sides! Today we’re ringing in spring with 17 of the best healthy side dish recipes that are perfect for pairing with literally any meal you make.",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "Ultimate Chili-Stuffed Sweet Potato Skins",
        "Delicious chili stuffed sweet potato skins that make the perfect game day appetizer or easy vegetarian lunch! Topped with melted cheese and a scoop of honey-lime chipotle yogurt sauce. This recipe is sponsored byBUSH’S® Beans.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F. Line a large baking sheet with parchment paper. Use a fork to poke several holes all over sweet potatoes. Place on prepared baking sheet. Bake for 1 hour or until easily pierced with a fork. Allow sweet potatoes to cool for 10-15 minutes. Turn up heat in oven to 425 degrees F.While the sweet potatoes are cooling, make the honey-lime chipotle yogurt sauce: In a small bowl mix together the yogurt, honey, lime juice and chipotle chili powder. Taste and adjust seasonings, adding more chili powder if you like things a little spicy. Place in fridge until ready to use.After sweet potatoes have cooled off, cut them in half lengthwise. Scoop out the inside flesh, leaving a thin layer flesh on sides and bottom of the sweet potato. Remember, it’s very important that you don’t scoop it all out or you won’t be able to fill the sweet potatoes up. You can use the leftover flesh for adding to smoothies or making muffins, pancakes or pie. Brush the inside and outsides of sweet potato with olive oil and sprinkle with a little salt. Bake in oven for 10-15 minutes to crisp up the outsides.Divide BUSH’S® Chili Beans evenly between sweet potatoes. Sprinkle cheese on top. Bake for 5 minutes or until cheese is melted. Add a little of the yogurt sauce on top, then garnish with green onion, jalapeño slices and cilantro. Best if enjoyed immediately, but will stay good if properly covered in fridge for up to 5-7 days. Serves 6."
        ],
        [
            [
                "",
                "3 medium-large sweet potato skins (about 3 inches in diameter and 5-6 inches long)"
            ],
            [
                "",
                "1/2 tablespoon olive oil"
            ],
            [
                "",
                "Salt"
            ],
            [
                "",
                "1 (15 ounce) can BUSH’S® Kidney Beans in a Mild Chili Sauce"
            ],
            [
                "",
                "½ cup shredded colby jack or mexican cheese"
            ],
            [
                "",
                "¼ cup plain greek yogurt or sour cream"
            ],
            [
                "",
                "1 teaspoon honey"
            ],
            [
                "",
                "½ lime, juiced"
            ],
            [
                "",
                "¼ teaspoon chipotle chili powder, plus more to taste"
            ],
            [
                "",
                "1 green onion, diced"
            ],
            [
                "",
                "Jalapeno slices"
            ],
            [
                "",
                "1 tablespoon fresh chopped cilantro"
            ],
            [
                "",
                "Chopped cooked bacon, if you’re feeling fancy"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Fresh & Healthy 7-Layer Dip",
        "The BEST healthy 7-layer dip ever made with beans, yogurt, taco seasoning, guacamole, cheese, tomatoes, black olives, onion, cilantro and jalapeños. Fresh, flavorful and absolutely delicious! Always a crowd-pleaser for game day and even holiday parties. This recipe is sponsored by siggi’s.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Spread refried beans all over the bottom of a 9x9 inch pan.In a medium bowl, mix together the yogurt and packet of taco seasoning (or DIY taco seasoning). Spread on top of refried beans.In a separate medium bowl, mash avocados with a fork until a mix between smooth and chunky. Stir in cilantro, jalapeno, lime juice and add salt and pepper to taste. Spread on top of yogurt.Finally, add remaining layers in the following order: shredded cheese, quartered grape tomatoes, sliced black olives, diced onion, cilantro and a few jalapeno slices. Cover and refrigerate until ready to serve. Recipe be can be made 24 hours in advance, but is best to make the day of! Serves 10. Serve with tortilla chips, plantain chips, pita chips, carrot sticks, celery or cucumber slices."
        ],
        [
            [
                "",
                "1 (15 ounce) can refried beans (use vegetarian refried beans if you are vegetarian)"
            ],
            [
                "",
                "For the taco layer:"
            ],
            [
                "",
                "3 5.3 oz containers or 2 cups from a 24oz tub of Plain siggi’s skyr"
            ],
            [
                "",
                "1 (1 ounce) packet of taco seasoning*"
            ],
            [
                "",
                "For the guacamole layer:"
            ],
            [
                "",
                "2 medium avocados"
            ],
            [
                "",
                "2-3 tablespoons chopped cilantro"
            ],
            [
                "",
                "1 jalapeño, seeded and diced"
            ],
            [
                "",
                "½ lime, juiced"
            ],
            [
                "",
                "Salt & pepper to taste"
            ],
            [
                "",
                "Remaining layers:"
            ],
            [
                "",
                "½ cup shredded cheddar or mexican cheese"
            ],
            [
                "",
                "1 ½ cups quartered grape tomatoes"
            ],
            [
                "",
                "¼ cup sliced black olives"
            ],
            [
                "",
                "2 tablespoons finely diced red onion or green onion"
            ],
            [
                "",
                "½ cup chopped fresh cilantro"
            ],
            [
                "",
                "Optional: jalapeno slices"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Vegan Potato Salad with Herbed Tahini Sauce",
        "Creamy no mayo added vegan potato salad coated with a beautiful green herbed tahini sauce made with tahini, fresh herbs, almondmilk, lemon and Dijon! A gorgeous and delicious take on traditional potato salad! This recipe is in partnership with Almond Breeze.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place potatoes in a large pot filled with water and 1 teaspoon salt and bring to a boil over high heat. Reduce heat to medium then boil for 10-13 minutes or until you can easily insert a knife into a potato.While the potatoes are boiling, make the tahini sauce: Add tahini sauce, lemon juice, almondmilk, garlic, dijon mustard, parsley, cilantro, dill, salt and pepper to a blender, and blend until smoothe and creamy. Taste and then add more salt and pepper, if necessary.When the potatoes are ready, drain them, transfer to a bowl and place them in the fridge for 1 hour or until completely cool.Once potatoes are cooled, slice them into ½ inch rounds and place in a bowl or on a large serving platter. Add green onions. Drizzle or toss with tahini dressing (I like to drizzle for presentation purposes.)Garnish with extra green onions and chopped dill. Serves 6-8."
        ],
        [
            [
                "",
                "¾ pound red potatoes"
            ],
            [
                "",
                "¾ pound purple potatoes"
            ],
            [
                "",
                "¾ pound yellow gold potatoes"
            ],
            [
                "",
                "*please note you can do a mix of any of these potatoes"
            ],
            [
                "",
                "½ cup diced green onions"
            ],
            [
                "",
                "⅓ cup tahini sauce"
            ],
            [
                "",
                "2 tablespoons fresh lemon juice"
            ],
            [
                "",
                "2-4 tablespoons Almond Breeze Almond Cashew Unsweetened Vanilla, to thin"
            ],
            [
                "",
                "1 clove garlic"
            ],
            [
                "",
                "1/2 teaspoon dijon mustard"
            ],
            [
                "",
                "⅓ cup chopped fresh Italian parsley"
            ],
            [
                "",
                "⅓ cup chopped fresh cilantro"
            ],
            [
                "",
                "1 tablespoon chopped fresh dill"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        [
            "Appetizer",
            " Side Dish",
            " Vegan",
            " Vegetarian"
        ]
    ],
    [
        "Peach, Goat Cheese & Basil Wonton Bites",
        "Juicy fresh peaches, creamy goat cheese and a balsamic reduction piled on a delicious baked wonton bites. The perfect summer appetizer ready in about 15 minutes! This recipe is in partnership with Nasoya.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 350 degrees F.While your oven preheats, place wonton wrapper halves evenly on a baking tray, spray with nonstick cooking spray and sprinkle with sea salt. Bake for 7-8 minutes or until golden brown.Next make your balsamic reduction: Add balsamic vinegar and sugar to a small saucepan and place over medium high heat. Bring mixture to a boil, then reduce to medium low and simmer for 15-20 minutes, stirring every so often until the balsamic vinegar turns into a thick syrup like consistency.Once your balsamic has been reduced by half (or to a syrup like consistency), remove from heat and set aside. Note: if the mixture hardens up after removing from heat, just reheat it over a low heat.After your wonton wrappers have cooled, spread each triangle with about ½ tablespoon of goat cheese and add about 1 tablespoon of diced peaches.Drizzle with your balsamic reduction then garnish with basil ribbons. Serve immediately. Serves 9, 4 wonton bites triangles per person."
        ],
        [
            [
                "",
                "18 Nasoya Won Ton Wraps, cut in half diagonally"
            ],
            [
                "",
                "2 medium yellow peaches, diced"
            ],
            [
                "",
                "4 ounces goat cheese log"
            ],
            [
                "",
                "8 basil leaves, julienned"
            ],
            [
                "",
                "Nonstick cooking spray"
            ],
            [
                "",
                "Sea salt"
            ],
            [
                "",
                "For the balsamic reduction:"
            ],
            [
                "",
                "¾ cup balsamic vinegar"
            ],
            [
                "",
                "1 tablespoon coconut sugar (any sugar will work)"
            ]
        ],
        [
            "Appetizer",
            " Snack"
        ]
    ],
    [
        "Jalapeño-Goat Cheese Grilled Stuffed Mini Peppers",
        "Grilled stuffed mini peppers that are both easy and delicious. This vegetarian appetizer is made with only 3 ingredients — goat cheese, jalapeñosand mini peppers!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat grill to medium high heat or about 400 degrees F. Oil the grates, then place peppers cut side up and grill for about 4-5 minutes per side until they have soften and have nice grill marks. Remove from grill.In a medium bowl, mix together the goat cheese and diced jalapeño. Stuff each pepper half with the jalapeño-goat cheese mixture. Serve immediately. Serves 8, about 4 pepper halves each."
        ],
        [
            [
                "",
                "1 pound mini sweet bell peppers, halved and seeds removed"
            ],
            [
                "",
                "6-8 ounces goat cheese log"
            ],
            [
                "",
                "1 jalapeño, finely chopped (seeds removed if you don’t like them spicy!)"
            ]
        ],
        [
            "Appetizer",
            " Vegetarian"
        ]
    ],
    [
        "Spicy Maple Dijon Grilled Brussels Sprouts",
        "Spicy maple grilled brussels sprouts are the most delicious side dish. The brussels sprouts get caramelized, slightly charred on the outside and are full of sweet and spicy flavor.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat grill to medium high heat (about 400 degrees F) and lightly oil the grate.Cut off the stem of the brussels sprouts (just the white part on the bottom) and remove any outer yellow leaves. Be very careful not to cut too much off the stem, otherwise the leaves will all fall off!Place brussels sprouts in a large bowl.In a small bowl, whisk together the olive oil, maple syrup, dijon, garlic, cayenne, salt and pepper. Pour all over the brussel sprouts and toss until they’re full coated.Skewer 4-5 brussels onto each skewer. Reserve extra sauce in the bottom of the bowl.Place skewers on grill, cooking for about 5-7 minutes per side, or until brussels sprouts are golden brown and slightly charred. Before serving, brush brussels with any remaining sauce and sprinkle with a little extra salt, if desired. Serves 4."
        ],
        [
            [
                "",
                "1 pound brussels sprouts"
            ],
            [
                "",
                "2 tablespoons olive oil"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "1-2 tablespoons dijon mustard"
            ],
            [
                "",
                "2 cloves garlic, finely minced"
            ],
            [
                "",
                "½ teaspoon cayenne pepper"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        []
    ],
    [
        "Best Healthy Coleslaw Ever (no mayo!)",
        "The BEST healthy coleslaw made with fresh purple cabbage, carrots, cilantro, and a kick of heat from jalapeño. There’s no mayo, just a naturally sweet and slightly tangy dressing. This simple, healthy coleslaw is perfect serving with your favorite grilling recipes all summer!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all the ingredients for the slaw except for the almonds and sunflower seeds to a large bowl.In a small bowl, whisk together all the ingredients for the dressing. Pour all over the slaw and toss well to combine. Taste and adjust seasonings as necessary. Cover and place in fridge for at least an hour to allow flavors to marinate together.Before serving, sprinkle with toasted sliced almonds and sunflower seeds or pepitas; toss again and serve."
        ],
        [
            [
                "",
                "1 medium head of purple cabbage, shredded"
            ],
            [
                "",
                "2 heaping cups shredded carrots"
            ],
            [
                "",
                "¾ cup finely chopped cilantro"
            ],
            [
                "",
                "1 jalapeños, seeded and finely diced"
            ],
            [
                "",
                "Optional: ½ cup diced scallions (the green part only of the green onion)"
            ],
            [
                "",
                "½ cup toasted sliced almonds (or sub chopped roasted almonds)"
            ],
            [
                "",
                "1/4 cup roasted sunflower seeds or pepitas"
            ],
            [
                "",
                "2 tablespoons extra virgin olive oil"
            ],
            [
                "",
                "2 tablespoons apple cider vinegar"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "1 clove garlic, minced"
            ],
            [
                "",
                "¼ teaspoon cayenne pepper"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly cracked black pepper"
            ]
        ],
        [
            "Appetizer",
            " Side Dish",
            " Vegetarian"
        ]
    ],
    [
        "Avocado Strawberry Mango Salsa",
        "Bright and flavorful Avocado Strawberry Mango Salsa for dipping chips or adding to salads, tacos, fish, or chicken! This new take on salsa has hints of sweetness from fresh strawberries and mango, creaminess from avocado, and a kick of heat from jalapeño. It takes just 15 minutes to make and is perfect for parties!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place all ingredients in a medium bowl and mix to combine. Garnish with extra cilantro. Serve with pita chips for dipping. Also great served on salmon, fish tacos or shrimp. Serves 4-6. Double the recipe to serve 10-12."
        ],
        [
            [
                "",
                "1 cup diced strawberries (a little more than a half pound of strawberries)"
            ],
            [
                "",
                "1 cup diced ripe mango (from 2 large mangoes)"
            ],
            [
                "",
                "1 avocado, diced"
            ],
            [
                "",
                "1 jalapeno, seeded and diced"
            ],
            [
                "",
                "2 tablespoons finely diced red onion"
            ],
            [
                "",
                "2-3 tablespoons diced cilantro"
            ],
            [
                "",
                "1 small lime, juiced"
            ],
            [
                "",
                "1/4 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "Multigrain pita chips, for serving/dipping"
            ]
        ],
        [
            "Appetizer",
            " Summer"
        ]
    ],
    [
        "31 Recipes for your Memorial Day Menu",
        "31 delicious Memorial Day recipes that are perfect for your holiday weekend menu! Skip the store-bought platters and bring these fun appetizers, flavorful grilling recipes, bright salads, and homemade sweets to your parties and potlucks. These recipes are guaranteed to impress guests!",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "17 Healthy Side Dish Recipes to Pair with Any Meal",
        "Sometimes the simplest recipes I make end up being my absolute favorites. To me there’s nothing better than a few fresh ingredients and a killer seasoning or sauce, especially when it comes to sides! Today we’re ringing in spring with 17 of the best healthy side dish recipes that are perfect for pairing with literally any meal you make.",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "The Best Garlic Bread You’ll Ever Eat",
        "This easy homemade BEST garlic bread recipe has fresh herbs, tons of flavorful roasted garlic, and is perfectly toasted. This garlic bread is a guaranteed crowd-pleaser!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 425 degrees F and line a large baking sheet with parchment paper or foil. Slice bread in half lengthwise and place on a large baking sheet, cut sides up.In a medium bowl, mix butter, garlic, parsley and salt together until well combined. Spread evenly over bread.Bake for 10-15 minutes or until slightly golden brown on the edges. If you want to add cheese, add it the last 2 minutes of baking. If you like a crispier garlic bread, bake for 3-5 minutes more, watching carefully until it is as golden as you like."
        ],
        [
            [
                "",
                "1 pound Italian loaf or French loaf"
            ],
            [
                "",
                "1/2 cup softened unsalted butter (can also use salted)*"
            ],
            [
                "",
                "4 cloves garlic, finely minced"
            ],
            [
                "",
                "1 tablespoon finely chopped fresh parsley"
            ],
            [
                "",
                "⅛ teaspoon sea salt"
            ],
            [
                "",
                "Optional:"
            ],
            [
                "",
                "¼ cup freshly grated parmesan cheese"
            ],
            [
                "",
                "OR"
            ],
            [
                "",
                "½ cup shredded mozzarella cheese"
            ],
            [
                "",
                "For garnishing:"
            ],
            [
                "",
                "Extra parsley and chives"
            ]
        ],
        [
            "Bread",
            " Appetizer"
        ]
    ],
    [
        "Tofu Vegan Nachos with Cashew Cheese Sauce",
        "Beautiful vegan nachos with tofu taco meat and a creamy nacho cashew cheese sauce. Everyone will love these loaded nachos for their next favorite appetizer!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "To make the cashew cheese sauce: Make sure you soak the cashews in 4 cups of water for at least 2 hours, otherwise you can place them large bowl, then add 4 cups boiling water and let the cashews soak in the hot water for approximately 45 minutes-1 hour to speed up the process. Once ready to make the sauce add drained cashews, garlic, nutritional yeast, water, turmeric, dry mustard and salt to a high powered blender. Blend until a thick sauce comes together, adding a tablespoon or two more of water, if necessary to help blend. Set aside.Place a large skillet over medium high heat, add olive oil. Once is hot, use your hands to crumble tofu and add to the pan. Sprinkle the spices and salt and pepper. Cook for 5 minutes, stirring frequently. Taste and add more salt and pepper, if necessary.Preheat oven to 375 degrees F. Line a large baking sheet with parchment paper. Add chips and spread out evenly. Sprinkle tofu, black beans, red bell pepper, onions evenly over the chips. Drizzle chips with the cashew cheese sauce. Bake for 10-15 minutes. Remove from oven and garnish with avocado, salsa, jalapeno, cilantro and hot sauce if desired. Serves 8 for an appetizer. Enjoy!"
        ],
        [
            [
                "",
                "For the cashew cheese sauce:"
            ],
            [
                "",
                "2 cups cashews, soaked for 2 hours and drained"
            ],
            [
                "",
                "2 garlic cloves"
            ],
            [
                "",
                "2-3 tablespoons nutritional yeast"
            ],
            [
                "",
                "1 ¼ cup water, plus more to thin if necessary"
            ],
            [
                "",
                "3/4 -1 teaspoon salt"
            ],
            [
                "",
                "¼ teaspoon turmeric (for color)"
            ],
            [
                "",
                "¼ teaspoon dry mustard"
            ],
            [
                "",
                "For the tofu:"
            ],
            [
                "",
                "1 teaspoon olive oil"
            ],
            [
                "",
                "1 package extra firm Nasoya tofu"
            ],
            [
                "",
                "1 ½ teaspoons chili powder"
            ],
            [
                "",
                "¾ teaspoon cumin"
            ],
            [
                "",
                "½ teaspoon paprika"
            ],
            [
                "",
                "½ teaspoon garlic powder"
            ],
            [
                "",
                "Salt and pepper, to taste"
            ],
            [
                "",
                "For the nachos:"
            ],
            [
                "",
                "8 servings your favorite tortilla chips (about 8 cups of tortilla chips)"
            ],
            [
                "",
                "1 (15 ounce) can black beans, rinsed and drained"
            ],
            [
                "",
                "1 red pepper, diced"
            ],
            [
                "",
                "1 white onion, diced"
            ],
            [
                "",
                "To garnish:"
            ],
            [
                "",
                "½ cup your favorite salsa"
            ],
            [
                "",
                "1 avocado, sliced or diced"
            ],
            [
                "",
                "1 jalapeno, sliced"
            ],
            [
                "",
                "Cilantro to garnish"
            ],
            [
                "",
                "Hot sauce, for drizzling"
            ]
        ],
        [
            "Vegan",
            " Gluten Free",
            " Grain Free"
        ]
    ],
    [
        "Spicy Maple Roasted Butternut Squash & Brussels Sprouts with Crispy Bacon + video",
        "Sweet and spicy maple roasted butternut squash with brussels sprouts and savory, crispy bacon. This filling, veggie-packed dish is perfect for a side dish or a main meal!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 400 degrees F. Line a large baking sheet with parchment paper. Spread out brussels sprouts and butternut squash. In small bowl mix together the olive oil, maple syrup, garlic, cayenne, cinnamon and cloves until well combined. Pour over the brussels and butternut squash. Season generously with salt and pepper. Use clean hands to toss together then spread out evenly on the baking sheet. Roast in the oven for 15 minutes then flip and roast for an additional 15 minutes until brussels turn a slight golden brown and squash is fork tender.While the veggies are roasting, cook your bacon according to the directions on the package. Remember you only need about 5 ounces (or about 4-6 slices). Once done cooking bacon and it’s crispy, transfer to a paper towel and pat away the grease as much as possible, then chop the bacon and set aside.Once the butternut squash and brussels are done roasting, transfer them to a large serving bowl and gently fold in chopped bacon, dried cranberries and toasted pecans. Garnish with your choice of crumbled cheese."
        ],
        [
            [
                "",
                "1 pound brussels sprouts, stems and outer leaves removed and halved"
            ],
            [
                "",
                "5 cups cubed butternut squash"
            ],
            [
                "",
                "2 tablespoons olive oil"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "3 garlic cloves, minced"
            ],
            [
                "",
                "1 teaspoon cayenne pepper"
            ],
            [
                "",
                "1/2 teaspoon cinnamon"
            ],
            [
                "",
                "⅛ teaspoon ground cloves"
            ],
            [
                "",
                "Freshly ground salt and pepper"
            ],
            [
                "",
                "4-5 oz uncooked bacon (either pork or turkey bacon will work)"
            ],
            [
                "",
                "⅓ cup dried cranberries"
            ],
            [
                "",
                "½ cup toasted pecans halves, chopped"
            ],
            [
                "",
                "⅓ cup your choice of gorgonzola crumbles, blue cheese crumbles or goat cheese crumbles"
            ]
        ],
        [
            "Side Dish",
            " Thanksgiving"
        ]
    ],
    [
        "Maple Glazed Carrots with Goat Cheese & Pistachios",
        "Delicious maple glazed carrots roasted with pure maple syrup and garlic. Topped with creamy goat cheese crumbles and crunchy pistachios — this easy, veggie side dish will impress everyone at your holiday gatherings!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees Farenheit.Place carrots on a large baking sheet, drizzle with olive oil and maple syrup, and top with garlic. Roast carrots for 35-45 minutes until fork tender.Top with goat cheese crumbles, pistachios, and finish with zest from lemon. Serve immediately."
        ],
        [
            [
                "",
                "Ingredients"
            ],
            [
                "",
                "2 pounds rainbow or regular carrots, peeled"
            ],
            [
                "",
                "2 tablespoons olive oil"
            ],
            [
                "",
                "2 tablespoons pure maple syrup"
            ],
            [
                "",
                "2 cloves garlic, minced"
            ],
            [
                "",
                "Freshly ground salt and pepper"
            ],
            [
                "",
                "1 ounce goat cheese crumbles"
            ],
            [
                "",
                "2 tablespoons roasted pistachios"
            ],
            [
                "",
                "Zest from 1 lemon"
            ]
        ],
        [
            "Vegetarian",
            " Side Dish"
        ]
    ],
    [
        "Sweet and Spicy Bacon Wrapped Plantains",
        "Bacon wrapped plantains with a hint of sweetness from pure maple syrup and a little spicy thanks to a kick of cayenne pepper. Everyone will be raving over this unique, easy appetizer!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F. Line a baking sheet with foil. Slice both plantains into 1/2 inch slices. Cut your strips of bacon in half.Take one plantain slice and wrap ½ piece of bacon around the flat side of the round. Repeat this step until each plantain slice is wrapped in ½ slice of bacon.Place all bacon-wrapped plantains on your baking sheet seam side down. Brush each with a little maple syrup. Sprinkle cayenne pepper on each plantain (use more if you like spicy flavors, and omit or only use a small pinch if you do not like spicy flavors).Bake in the oven for 30-40 minutes until the bacon is crispy. Stick a toothpick in each bacon-wrapped plantain, place on a serving tray and enjoy! Serves 6."
        ],
        [
            [
                "",
                "2 large dark spotted plantains"
            ],
            [
                "",
                "12 ounces uncooked bacon"
            ],
            [
                "",
                "1-2 tablespoons pure maple syrup"
            ],
            [
                "",
                "Cayenne pepper, to season"
            ]
        ],
        [
            "Gluten Free",
            " Grain Free",
            " Paleo",
            " Dairy Free",
            " Appetizer"
        ]
    ],
    [
        "Healthy Thai Peanut Dressing",
        "Deliciously addicting, healthy Thai peanut dressing with creamy, peanut butter flavor. You’re going to love this easy 5-ingredient dressing as a go-to for salads or dips!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4."
        ],
        [
            [
                "",
                "1/4 cup peanut butter"
            ],
            [
                "",
                "1 tablespoon gluten free soy sauce or coconut aminos"
            ],
            [
                "",
                "2 teaspoons honey"
            ],
            [
                "",
                "1/2 teaspoon ground ginger (or 2 teaspoons fresh grated ginger)"
            ],
            [
                "",
                "2 teaspoons apple cider vinegar"
            ],
            [
                "",
                "2-4 tablespoons warm water, to thin dressing"
            ],
            [
                "",
                "Optional: 1/2 teaspoon cayenne pepper to make it spicy"
            ]
        ],
        [
            "Dressing",
            " Dip"
        ]
    ],
    [
        "Healthy Greek Dressing",
        "Easy, flavorful healthy greek dressing that’s perfect for salads and marinades! This delicious 5-ingredient dressing will be a staple for lunches and dinners.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4."
        ],
        [
            [
                "",
                "¼ cup red wine vinegar"
            ],
            [
                "",
                "3 tablespoons extra virgin olive oil"
            ],
            [
                "",
                "2 garlic cloves, minced"
            ],
            [
                "",
                "1 teaspoon dijon mustard"
            ],
            [
                "",
                "½ teaspoon dried oregano"
            ],
            [
                "",
                "Salt and pepper, to taste"
            ]
        ],
        [
            "Salad Dressing"
        ]
    ],
    [
        "Saucy Stovetop Thai Green Beans",
        "Thai Green Beans made on the stovetop with a delicious easy peanut sauce. These will be your new favorite way to eat green beans!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place a large skillet over medium heat. Add in 1/2 tablespoon sesame oil and garlic, saute for 30 seconds or until garlic is fragrant. Immediately add in green beans; stir frequently until beans are slightly golden brown, about 5-8 minutes.While the beans are cooking, make the sauce: In a medium bowl, add soy sauce, sesame oil, peanut butter, ginger, vinegar, red pepper flakes and water. Stir to combine.One green beans are cooked and slightly golden and al dente, reduce heat to low and pour sauce over the beans. Stir to coat the beans, then cover and simmer for a few minutes to allow the beans to continue cooking.Taste and add salt, if necessary. Garnish with sliced green onion, sesame seeds and a tablespoon or two of cashews."
        ],
        [
            [
                "",
                "For the green beans:"
            ],
            [
                "",
                "1/2 tablespoon toasted sesame oil"
            ],
            [
                "",
                "2 cloves garlic, thinly sliced"
            ],
            [
                "",
                "1 pound green beans, rinsed and ends trimmed"
            ],
            [
                "",
                "For the sauce:"
            ],
            [
                "",
                "1 tablespoon reduced sodium soy sauce or coconut aminos"
            ],
            [
                "",
                "1/2 tablespoon toasted sesame oil"
            ],
            [
                "",
                "2 tablespoons creamy peanut butter"
            ],
            [
                "",
                "1 teaspoon freshly grated ginger"
            ],
            [
                "",
                "1 teaspoon rice wine vinegar"
            ],
            [
                "",
                "1/4 teaspoon red pepper flakes"
            ],
            [
                "",
                "1/4 cup water"
            ],
            [
                "",
                "Salt, to taste"
            ],
            [
                "",
                "To garnish: Green onion, sesame seeds and a tablespoon or two of cashews/roasted peanuts"
            ]
        ],
        [
            "Vegetarian",
            " Gluten Free"
        ]
    ],
    [
        "Pesto Tuna Caprese Cucumber Bites + video!",
        "Quick and flavorful cucumber bites topped with delicious pesto flavored Genova tuna, fresh tomato and basil, creamy mozzarella, and a drizzle of homemade balsamic reduction. These little Caprese bites are light, healthy, and perfect for entertaining!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add balsamic vinegar and sugar to a small saucepan and place over medium high heat. Bring mixture to a boil, then reduce to medium low and simmer for 15-20 minutes, stirring every so often until the balsamic vinegar turns into a thick syrup like consistency. Remove from heat and set aside. Note: if the mixture hardens up after removing from heat, just reheat it over a low heat.While the balsamic vinegar is boiling, add the tuna, pesto and freshly ground black pepper to a small bowl; stir to combine. Place about a ½ tablespoon of tuna pesto mixture on each cucumber round. Top with mozzarella ball, cherry tomato half, and small basil leaf and secure with a toothpick. Transfer all to a platter. Drizzle with balsamic reduction and serve immediately. Makes 14 bites."
        ],
        [
            [
                "",
                "For the cucumber bites:"
            ],
            [
                "",
                "1 medium cucumbers, sliced into ½ inch rounds (I used an english cucumber from trader joe’s)"
            ],
            [
                "",
                "1 (5 oz) can Genova Yellowfin or Albacore Tuna in Easy-Open can, drained"
            ],
            [
                "",
                "3 tablespoons store bought pesto"
            ],
            [
                "",
                "Freshly ground black pepper, to taste"
            ],
            [
                "",
                "7 cherry tomatoes, halved"
            ],
            [
                "",
                "7 basil leaves"
            ],
            [
                "",
                "14 mini mozzarella balls (or you can just make small round mozz circles if you can’t find the balls)"
            ],
            [
                "",
                "For the balsamic glaze:"
            ],
            [
                "",
                "1 cup balsamic vinegar"
            ],
            [
                "",
                "1 tablespoon sugar (any will work)"
            ]
        ],
        [
            "Appetizer"
        ]
    ],
    [
        "Roasted Strawberry, Basil, and Goat Cheese Crostini from Love Real Food",
        "Gorgeous roasted strawberries paired with creamy goat cheese and fresh basil on top of crispy crostini. An incredible summer appetizer that’s perfect for entertaining!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat the oven to 350 degrees F with racks in the middle and upper third of the oven. Line two large rimmed baking sheets with parchment paper for easier cleanup. Set the goat cheese on the counter to soften up a bit.On one baking sheet, toss the strawberries with the honey, then spread the strawberries into a single layer. Bake on the upper rack until the fruit is tender, juicy, and collapses on itself, 20 to 25 minutes, tossing halfway. Watch the fruit on the edges of the pan, as the honey can burn quickly.Meanwhile, on the remaining baking sheet, brush the olive oil lightly over both sides of each slice of bread. Bake on the middle rack until the toasts are golden on top, 10 to 12 minutes.Once the toasts are cool enough to safely handle, top each one with a smear of goat cheese, followed by a spoonful of roasted strawberries and their juices. Finish off the crostini with a sprinkling of torn basil and black pepper. Crostini are best served immediately."
        ],
        [
            [
                "",
                "4 to 5 ounces goat cheese"
            ],
            [
                "",
                "1 pound strawberries, hulled and cut into bite-size pieces"
            ],
            [
                "",
                "2 tablespoons honey"
            ],
            [
                "",
                "2 tablespoons extra-virgin olive oil"
            ],
            [
                "",
                "1 whole-grain baguette or small loaf of crusty whole-grain bread (about 14 ounces), cut into 1/2-inch slices"
            ],
            [
                "",
                "Small handful of fresh basil leaves, torn into little pieces"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        [
            "Appetizer",
            " Vegetarian"
        ]
    ],
    [
        "Healthy Greek Yogurt Ranch Dressing",
        "Creamy healthy greek yogurt ranch dressing with ingredients that you can feel good about! This easy dressing will be your new go-to for salads, dips, and more. Skip the bottled stuff for good!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4, 2 tablespoons each."
        ],
        [
            [
                "",
                "1/2 cup nonfat plain greek yogurt"
            ],
            [
                "",
                "1 teaspoon garlic powder"
            ],
            [
                "",
                "1/4 teaspoon onion powder"
            ],
            [
                "",
                "1 ½ teaspoons fresh lemon juice (or can sub apple cider vinegar)"
            ],
            [
                "",
                "1/2 teaspoon dried dill or fresh chopped chives"
            ],
            [
                "",
                "1/4 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "2 tablespoons water to thin dressing"
            ],
            [
                "",
                "Optional: 1/4 teaspoon honey"
            ]
        ],
        [
            "Dressing",
            " Dip"
        ]
    ],
    [
        "Sesame Garlic Grilled Sweet Potato Fries with Yogurt Curry Dip",
        "Did you know you can make grilled sweet potato fries in no time at all? Try this amazing recipe for sweet potato fries with a hint of garlic and sesame flavor! Served with a yogurt curry dip.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat grill to 375 degrees F or medium heat. In a large bowl toss sweet potato wedges, sesame oil, garlic, and salt.Make the dip by combining the yogurt, curry powder, lime juice, maple syrup, salt and cayenne in a small bowl. Place in the fridge until you are ready to serve.Once the grill is preheated, place the sweet potato wedges on the grill and cook about 4-5 minutes on each side. They should get nice grill marks; make sure you watch closely so that the fries do not burn.Once done, transfer to a plate and garnish with sesame seeds and fresh cilantro.Serve with the yogurt curry dip."
        ],
        [
            [
                "",
                "For the sweet potato fries:"
            ],
            [
                "",
                "2 large sweet potatoes (or 3 medium), cut into about 1 inch wide wedges"
            ],
            [
                "",
                "1 ½ tablespoons toasted sesame oil (regular sesame oil or olive oil also works)"
            ],
            [
                "",
                "3 cloves garlic, finely minced"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ],
            [
                "",
                "For the Yogurt Curry Dip:"
            ],
            [
                "",
                "1/3 cup nonfat plain Greek yogurt"
            ],
            [
                "",
                "1 teaspoon curry powder"
            ],
            [
                "",
                "2 teaspoons fresh lime or orange juice"
            ],
            [
                "",
                "1 teaspoon pure maple syrup"
            ],
            [
                "",
                "⅛ teaspoon salt"
            ],
            [
                "",
                "1 tablespoon water to thin dip, if necessary"
            ],
            [
                "",
                "Optional: pinch of cayenne pepper"
            ],
            [
                "",
                "To garnish:"
            ],
            [
                "",
                "Fresh cilantro"
            ],
            [
                "",
                "Sesame seeds"
            ]
        ],
        [
            "Appetizers",
            " Side Dish",
            " Dinner"
        ]
    ],
    [
        "Roasted Sweet Potato & Arugula Salad with Turmeric Honey Mustard Yogurt Dressing + thoughts on self love",
        "Roasted sweet potato arugula salad is a perfect lunch or appetizer. Topped with a light honey mustard yogurt dressing with a hint of gorgeous turmeric color.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat 400 degrees F. Line a large baking sheet with parchment paper. Add sweet potato wedges to the pan and drizzle with olive oil. Add minced garlic, salt and pepper and toss well to combine. Bake wedges for 20-30 minutes, flipping halfway through, until tender and golden.While the potatoes are roasting, you can make the dressing: In a small bowl whisk together yogurt, dijon, honey and turmeric. Thin the dressing out with a few teaspoons of water so that you are able to drizzle it over the salad. Place in fridge until ready to use.Once the sweet potato wedges are done baking, remove from oven and allow to cool for 5 minutes. Add fresh arugula on top, along with cherries and almonds, then drizzle with dressing and serve immediately. Serves 2 and makes a wonderful lunch or appetizer. Also great when served cold!"
        ],
        [
            [
                "",
                "1 1/2 tablespoons olive oil"
            ],
            [
                "",
                "2 medium sweet potatoes, cut into 1/2 inch thick wedges"
            ],
            [
                "",
                "2 garlic cloves, minced"
            ],
            [
                "",
                "1/2 teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ],
            [
                "",
                "For the dressing:"
            ],
            [
                "",
                "1/4 cup nonfat greek yogurt"
            ],
            [
                "",
                "1 teaspoon dijon mustard"
            ],
            [
                "",
                "1 teaspoon honey"
            ],
            [
                "",
                "1/4 teaspoon ground turmeric"
            ],
            [
                "",
                "For the topping:"
            ],
            [
                "",
                "2-3 cups fresh arugula"
            ],
            [
                "",
                "1/4 cup dried cherries"
            ],
            [
                "",
                "1/4 cup toasted sliced almonds"
            ]
        ],
        [
            "Salad",
            " Vegetarian"
        ]
    ],
    [
        "Vegan Turmeric Pineapple Tofu Kabobs",
        "Beautiful ready to grill tofu kabobs made with extra firm Nasoya Tofu, a soy ginger turmeric marinade and fresh pineapple cubes. Delicious and perfect for the vegetarians in your life!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Remove tofu from package, wrap with a paper towel and gently squeeze and pat to remove excess moisture. Cube the tofu into large 1 ½ inch cubes.In a large bowl, add the tamari, apple cider vinegar, pineapple juice, ginger, garlic and turmeric. Whisk to combine. Add the tofu cubes and gently toss with your hands or a wooden spoon to coat them with the marinade. Cover with plastic wrap and allow them to marinate for at least 30 minutes, or up to 24 hours.Once ready to cook, preheat the grill to medium high heat and oil the grates to prevent sticking.Thread the tofu and pineapple onto skewers, you should get about 8 skewers total. Grill for 10 minutes total, rotating every few minutes. Enjoy with fresh cilantro, green onion and hot sauce, if desired."
        ],
        [
            [
                "",
                "2 tablespoons tamari (gluten free soy sauce)"
            ],
            [
                "",
                "1 teaspoon apple cider vinegar"
            ],
            [
                "",
                "2 tablespoons fresh pineapple juice"
            ],
            [
                "",
                "2 teaspoon freshly grated ginger"
            ],
            [
                "",
                "2 cloves garlic, minced"
            ],
            [
                "",
                "½ teaspoon ground turmeric (or 1 teaspoon freshly grated turmeric)"
            ],
            [
                "",
                "1 (14 oz) package Nasoya extra firm tofu"
            ],
            [
                "",
                "2 cups fresh cubed pineapple"
            ],
            [
                "",
                "Fresh chopped cilantro, diced onion and hot sauce, to garnish"
            ]
        ],
        []
    ],
    [
        "Caramelized Onion, Fig & Goat Cheese Pizza with Arugula + video",
        "Amazing fig and goat cheese pizza with caramelized onion, goat cheese and an easy homemade 100% whole wheat pizza dough made in partnership with Almond Breeze. Seriously sooooo good.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "First start by making the crust: In a large bowl of an electric mixer, mix almond milk, yeast, honey and olive oil together. Let it sit for a few minutes; you will know your yeast has activated if it begins to foam and bubble after a few minutes. If it doesn’t start to foam or bubble, start over as this is critical to making good dough. After just a few minutes, mix in whole wheat pastry flour, cornmeal and salt with a wooden spoon. Place dough hook on mixer and knead dough on medium speed for 8 minutes. Dough should form into a nice ball and be slightly sticky. (If you don’t want to use an electric mixer, you can use your hands to knead the dough for 8-10 minutes.)Next place dough in a medium bowl lightly oiled with olive oil. Cover with plastic wrap and a towel and let rise for 1 hour or until dough has doubled in size. It’s better if it’s in a slightly warm place.While the dough is rising, you can make the caramelized onions: place olive oil a small saucepan over medium heat, add onion slices, spread the onions evenly out in the pan and cook, stirring occasionally. Check onions every 10-15 minutes until they have completely caramelized and turned golden in color. This usually takes 20-30 minutes total.After dough has doubled, preheat oven to 450 degrees F. Add parchment paper to a large baking sheet, or grease with nonstick cooking spray.Grease 11x9 or 8x12 inch baking sheet generously with olive oil or nonstick cooking spray. Sprinkle with a little cornmeal. Dump dough into an oil rimmed baking sheet, and stretch dough out towards the edges. Cover with plastic wrap and let it sit for another 20 minutes. It’s okay if it doesn’t stretch all the way to the edges right way, it just needs a little time to rest.Make the balsamic reduction: Add balsamic vinegar to a small pot and place over low heat. Allow it to simmer for 10-15 minutes until reduced by half, then set aside until you are ready to enjoy on the pizza.After dough rests, pull again towards the edges of the pan so that it forms a nice small crust. Brush crust with a little olive oil. Bake for 10-15 minutes, until pizza is slightly golden brown on the crust and bottom.Brush dough or drizzle with just a little bit of olive oil, spread caramelized onions over the pizza, along with the figs and goat cheese. Bake for 5 more minutes or until onions and figs are warmed through.Remove pizza from oven and top with arugula and drizzle with balsamic reduction. Cut into 10-12 squares and enjoy!"
        ],
        [
            [
                "",
                "¾ cup warm Unsweetened Original Almond Breeze Almondmilk, 110-115 degrees F"
            ],
            [
                "",
                "½ tablespoon honey"
            ],
            [
                "",
                "1 tablespoon olive oil"
            ],
            [
                "",
                "2 1/4 teaspoons instant yeast (1 packet)"
            ],
            [
                "",
                "2 cups whole wheat pastry flour"
            ],
            [
                "",
                "1/2 tablespoon yellow cornmeal, plus extra for dusting"
            ],
            [
                "",
                "1 teaspoon salt"
            ],
            [
                "",
                "Olive oil, for the crust"
            ],
            [
                "",
                "2 teaspoons olive oil"
            ],
            [
                "",
                "1 yellow onion, sliced"
            ],
            [
                "",
                "12 dried mission figs, stems trimmed, cut into quarters"
            ],
            [
                "",
                "5 ounce package soft fresh goat cheese, coarsely crumbled"
            ],
            [
                "",
                "1-2 cups fresh arugula"
            ],
            [
                "",
                "1/2 cup good-quality balsamic vinegar"
            ]
        ],
        [
            "Pizza",
            " Vegetarian"
        ]
    ],
    [
        "Healthy Lemon Basil Vinaigrette",
        "Homemade healthy lemon basil vinaigrette that’s perfect for spring! This light, fresh dressing makes the perfect marinade or delicious dressing.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4."
        ],
        [
            [
                "",
                "1/4 cup freshly squeezed lemon juice"
            ],
            [
                "",
                "1/4 cup olive oil"
            ],
            [
                "",
                "1 garlic clove, minced"
            ],
            [
                "",
                "1/2 teaspoon dijon mustard"
            ],
            [
                "",
                "1/2 teaspoon honey"
            ],
            [
                "",
                "4-6 large basil leaves, very finely diced"
            ],
            [
                "",
                "Freshly ground salt and black pepper, to taste"
            ]
        ],
        [
            "Salad Dressing"
        ]
    ],
    [
        "Healthy Chipotle Ranch Dressing",
        "Incredibly delicious healthy chipotle ranch dressing made with greek yogurt. This creamy dressing or dip has a kick of heat and will be a new favorite to drizzle on tacos or southwest inspired meals and is delicious for dipping sweet potato fries in.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4."
        ],
        [
            [
                "",
                "1/2 cup nonfat plain greek yogurt"
            ],
            [
                "",
                "1 teaspoon garlic powder"
            ],
            [
                "",
                "1/4 teaspoon onion powder"
            ],
            [
                "",
                "1 teaspoon fresh lemon juice (or can sub apple cider vinegar)"
            ],
            [
                "",
                "1/2 teaspoon dried dill"
            ],
            [
                "",
                "1/4 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "3/4 teaspoon chipotle chili powder, or sub a few dashes of chipotle tabasco hot sauce"
            ],
            [
                "",
                "2 tablespoons water to thin dressing"
            ]
        ],
        [
            "Salad Dressing",
            " Dips"
        ]
    ],
    [
        "Healthy Raspberry Balsamic Dressing",
        "Fresh, flavorful healthy raspberry balsamic dressing with a hint of sweetness. This light dressing is slightly tangy for a delicious addition to any dish!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined. Dressing serves 4."
        ],
        [
            [
                "",
                "3 tablespoons balsamic vinegar"
            ],
            [
                "",
                "3 tablespoons extra virgin olive oil"
            ],
            [
                "",
                "1 garlic clove, minced"
            ],
            [
                "",
                "1 teaspoon dijon mustard"
            ],
            [
                "",
                "1 tablespoon raspberry jam"
            ],
            [
                "",
                "Salt and pepper, to taste"
            ]
        ],
        []
    ],
    [
        "Healthy Curry Tahini Dressing",
        "Delicious, creamy healthy curry tahini dressing with turmeric, garlic, ginger and curry flavors. This addicting dressing or dip will be your new favorite way to use tahini!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add all ingredients to a bowl or a mason jar and mix until well combined. If using a mason jar, you can simply put the lid on and shake the jar until well combined."
        ],
        [
            [
                "",
                "1/4 cup tahini"
            ],
            [
                "",
                "1/2 lemon, juiced"
            ],
            [
                "",
                "3-4 tablespoons warm water, to thin dressing"
            ],
            [
                "",
                "1 clove garlic, finely minced"
            ],
            [
                "",
                "1-2 teaspoons pure maple syrup, to sweeten"
            ],
            [
                "",
                "1 teaspoon yellow curry powder"
            ],
            [
                "",
                "½ tablespoon freshly grated ginger"
            ],
            [
                "",
                "½ teaspoon ground turmeric"
            ],
            [
                "",
                "½ teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        []
    ],
    [
        "The Best Guacamole You’ll Ever Eat",
        "The best guacamole recipe EVER. A mix between creamy and chunky with bites of heat from jalapeno and flavor from cilantro and lime juice. You need this in your life!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Mash avocado in a medium bowl, but not so much that it becomes overly creamy. You want a mixture between chunky and creamy consistency. Next add in lime juice, grape tomatoes, diced onion, jalapeno, cilantro and salt and pepper. Give it a stir. Taste and adjust seasonings as necessary (add more salt if you like it a little bit saltier!). Garnish with extra sliced grape tomatoes, cilantro and jalapenos. Enjoy with blue corn tortilla chips."
        ],
        [
            [
                "",
                "3 ripe avocados"
            ],
            [
                "",
                "1/2 lime, juiced"
            ],
            [
                "",
                "3/4 cup grape tomatoes, quartered"
            ],
            [
                "",
                "1/2 cup diced white onion"
            ],
            [
                "",
                "1 jalapeno, finely diced (or two if you like it spicy!)"
            ],
            [
                "",
                "1/2 cup chopped cilantro"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ]
        ],
        [
            "Appetizer",
            " Vegan",
            " Gluten Free",
            " Grain Free",
            " Paleo"
        ]
    ],
    [
        "Spinach & Goat Cheese Quiche with Sweet Potato Crust + Blue Diamond Orchard Recap",
        "Spinach and goat cheese quiche made with a scrumptious sweet potato crust that helps to hold the quiche nicely together without all the calories of a regular crust.Gluten free!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F. Grease a 9 inch pie pan with nonstick cooking spray. Add sweet potato slices all around the base (as the photo shows in the picture above). Cut some in half if you need them to fit on the sides. Spray the sweet potatoes with additional nonstick cooking spray. Bake for 20 minutes. Once done, remove from oven and allow to cool for 5 minutes. Keep heat in oven.While sweet potato crust is baking, cook the veggies: Add olive oil to a medium skillet and place over medium high heat. Add in onion, jalapeno, diced tomato; saute for a few minutes. Then add spinach and saute for another few minutes, or until spinach wilts. Remove from heat and set aside to cool.In a medium bowl, whisk together eggs, egg whites, almondmilk, salt and pepper.Add spinach mixture over the baked sweet potato crust, then pour egg mixture over the top. Sprinkle goat cheese crumbles on top along with an additional sprinkle of salt and pepper.Bake for 30-45 minutes or until egg sets and puffs up. Remove from heat and allow to cool for a few minutes before cutting into 6 slices. Enjoy!"
        ],
        [
            [
                "",
                "Coconut oil cooking spray"
            ],
            [
                "",
                "1 large sweet potato, cut into 1/8th inch slices"
            ],
            [
                "",
                "1 teaspoon olive oil"
            ],
            [
                "",
                "1 small white onion, diced"
            ],
            [
                "",
                "1 large roma tomato, diced"
            ],
            [
                "",
                "1 jalapeno, seeded and diced"
            ],
            [
                "",
                "1 (5 oz) bag of spinach"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ],
            [
                "",
                "4 large egg"
            ],
            [
                "",
                "4 large egg whites"
            ],
            [
                "",
                "1/3 cup Almond Breeze unsweetened almondmilk"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper"
            ],
            [
                "",
                "1/2 cup goat cheese crumbles"
            ]
        ],
        []
    ],
    [
        "Liz’s Incredible Salsa Verde",
        "Have you guys been to my friend Liz’s site yet? She’s a mama of two who blogs about healthy authentic food with global flavors. I freaking love her because she’s the real deal in every way; Liz tells it how it is and keeps herself authentic and real. We’ve been friends for years and every single time we’re together we giggle over the most ridiculous things (including that one time she had someone deliver Buffalo Wild Wings to my hotel room).",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Remove the shell from the tomatillos and rinse well. Place in a large pot along with the peppers and cover with water 2/3 of the way up the pot. Bring to a boil then reduce heat to low. Simmer until tomatillos start to crack and split, roughly 20 minutes. Remove from heat and let cool.Place cooked tomatillos and serranos in a blender along with all the cooking liquid. Add cilantro, garlic, onion and salt to taste. Blend until you’ve reached desired thickness."
        ],
        [
            [
                "",
                "40 tomatillos (green)"
            ],
            [
                "",
                "12 whole serrano peppers, stems removed"
            ],
            [
                "",
                "1 bunch of cilantro"
            ],
            [
                "",
                "1 clove garlic"
            ],
            [
                "",
                "1/4 medium onion"
            ],
            [
                "",
                "salt to your liking"
            ]
        ],
        [
            "Salsa",
            " Snack"
        ]
    ],
    [
        "Chai-Spiced Almond Hazelnut Butter",
        "Chai spices make this almond hazelnutbutter recipe taste like your favorite chai tea latte. Spread it on toast, fruit or stuff it in sweet potatoes for the ultimate treat.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 350 degrees F and add hazelnuts and almonds to a large baking sheet, spreading out to evenly distribute. Roast for 10-12 minutes or until slightly golden.Allow nuts to cool for 5 minutes then transfer to a kitchen towel. Wrap nuts in towel and use your hands to roll the nuts around so that you remove the skins of the hazelnuts (don't worry about almonds). This helps to achieve a creamier nut butter. Keeping the skins on is okay though, just know your nut butter won't be as creamy.Once most of the skins are off the hazelnuts, you can transfer the nuts to the food processor or high speed blender (such as a Vitamix). Process on high until smooth, scraping down the sides as necessary. Add coconut sugar & coconut oil to assist in blending. At this point the nuts should start to clump together. Continue to process until you reach the desired consistency. I like mine extra creamy!Once nut butter is blended, add in the spices and salt and blend for 30 seconds more. Pour into a large glass jar or container. To keep fresh, store in the fridge for up to 1 month. Not that it would last that long."
        ],
        [
            [
                "",
                "2 cups raw almonds"
            ],
            [
                "",
                "2 cups raw hazelnuts"
            ],
            [
                "",
                "2 teaspoons coconut sugar"
            ],
            [
                "",
                "1 tablespoon coconut oil, plus more if necessary"
            ],
            [
                "",
                "1 teaspoon ground cinnamon"
            ],
            [
                "",
                "1/2 teaspoon cardamom"
            ],
            [
                "",
                "1/4 teaspoon ground ginger"
            ],
            [
                "",
                "1/8 teaspoon all spice"
            ],
            [
                "",
                "1/8 teaspoon ground cloves"
            ],
            [
                "",
                "1/8 teaspoon nutmeg"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ]
        ],
        [
            "Nut Butter",
            " Snack",
            " Breakfast",
            " Vegan",
            " Gluten Free",
            " Grain Free",
            " Paleo"
        ]
    ],
    [
        "Vegan Curried Sweet Potato Corn Chowder",
        "Ready for this vegan sweet potato corn chowder with a little hint of curry spice? It’s comforting, filling and a wonderful way to use up fresh or frozen summer corn.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "In a large soup pot over medium heat add the olive oil, onion, jalapeno, garlic, sweet potatoes, corn and saute for 6-8 minutes or until potatoes start to soften. Season with curry powder and ginger.Slowly stir in the milk and vegetarian broth, scraping up any bits from the bottom of the pan as you stir. Reduce the heat to low and simmer for 10 to 15 minutes or until the potatoes are tender and can easily be pierced with a fork.To give a creamy texture, blend 3 cups of the soup (BE CAREFUL WHILE DOING THIS!) then return to the pot. Stir to incorporate and season with salt and pepper. Taste and adjust seasonings as necessary.To serve, sprinkle with cilantro, a swirl of greek yogurt (or a coconut yogurt if vegan) and green onions. Makes 4 servings."
        ],
        [
            [
                "",
                "1 tablespoon olive oil"
            ],
            [
                "",
                "1 medium onion, chopped"
            ],
            [
                "",
                "1 jalapeno, seeded and chopped"
            ],
            [
                "",
                "3 garlic cloves, minced"
            ],
            [
                "",
                "1 large sweet potato, peeled and diced (about 3-4 cup diced sweet potatoes)"
            ],
            [
                "",
                "4 ears of sweet corn, kernels removed from the cob (about 4 cups of corn)"
            ],
            [
                "",
                "2 teaspoons curry powder (I like spicy curry powder)"
            ],
            [
                "",
                "pinch of ground ginger"
            ],
            [
                "",
                "1 (15oz) light coconut milk from the can"
            ],
            [
                "",
                "2 cups vegetarian broth"
            ],
            [
                "",
                "1/2 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "Freshly ground black pepper"
            ],
            [
                "",
                "To garnish, if desired: greek yogurt or goat cheese, cilantro and green onions"
            ]
        ],
        [
            "Vegan",
            " Soup",
            " Sweet Potato",
            " Gluten Free"
        ]
    ],
    [
        "High-Protein Black Bean Avocado Tuna Salad Sandwiches",
        "Oh hi Monday, you’re here again. Do you have your cup of joe? Maybe paired with a big bowl of steaming hot oatmeal with blueberries for breakfast? Me too.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "In a large bowl, mash avocado. Fold in tuna then add in the following: cilantro, tomato halves, lime/lemon juice, salt and pepper. Mix to combine.Toast bread and spoon tuna salad on top. Garnish with extra cilantro and goat cheese. Enjoy! Makes 2 open faced sandwiches."
        ],
        [
            [
                "",
                "1/2 large avocado, mashed"
            ],
            [
                "",
                "1 can Genova Yellowfin Tuna in olive oil, drained"
            ],
            [
                "",
                "1/2 cup black beans (salt free or low sodium, preferred)"
            ],
            [
                "",
                "1/4 cup chopped cilantro"
            ],
            [
                "",
                "10 grape tomatoes, halved"
            ],
            [
                "",
                "juice from 1/2 lemon (a lime will also work)"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ],
            [
                "",
                "Freshly ground black pepper, to taste"
            ],
            [
                "",
                "2 slices sprouted, gluten free or whole grain bread (can also use lettuce wraps)"
            ],
            [
                "",
                "2 tablespoons goat cheese crumbles"
            ]
        ],
        [
            "Sandwich",
            " Salad",
            " Lunch",
            " Easy",
            " Gluten Free",
            " Dairy Free"
        ]
    ],
    [
        "Vegetarian Calabacitas Quesadillas",
        "Quesadilla time!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add olive oil to a medium skillet and place over medium heat. Next add in garlic, onion, jalapeno, zucchini and corn; saute for 5-6 minutes or until onion begins to soften and become translucent. Stir in cumin and salt and pepper. Remove from heat and set aside in a bowl.In the same skillet, add another teaspoon of oil or spray with nonstick cooking spray. Add 1 whole wheat tortilla and then most of the calabacitas mixture. Top with Go Veggie cheese shreds then top with the other tortilla. Cook 2-4 minutes or until the side is golden brown. Flip tortilla to the other side and cook until golden brown and cheese is melted.Cut into 4 large slices or 6 medium slices. Serves 2 people. Serve with salsa and guacamole."
        ],
        [
            [
                "",
                "1 teaspoon olive oil"
            ],
            [
                "",
                "2 cloves garlic, minced"
            ],
            [
                "",
                "1/2 yellow onion, diced"
            ],
            [
                "",
                "1 jalapeno, seeded and diced"
            ],
            [
                "",
                "1 small zucchini, quartered"
            ],
            [
                "",
                "Kernels from 1 ear of sweet corn"
            ],
            [
                "",
                "1/4 teaspoon cumin"
            ],
            [
                "",
                "Freshly ground salt and pepper, to taste"
            ],
            [
                "",
                "2 large whole wheat tortillas"
            ],
            [
                "",
                "1/2 cup Go Veggie Vegan Mexican Shreds"
            ]
        ],
        [
            "Vegan",
            " Vegetarian",
            " Lunch",
            " Sandwiches"
        ]
    ],
    [
        "Healthy Baked French Fries with Garlic, Parmesan & Truffle Oil",
        "A few months ago, Tony and I had the chance to visit Pensacola, Florida where we had the absolute BEST truffle fries on the planet. The heavenly hot fries were full of garlic and truffle flavor, melted in your mouth and had this beautiful crusty golden exterior that I just couldn’t get over. ",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 400 degrees F. Line two large baking sheets with parchment paper and generously spray with nonstick cooking spray.Cut potatoes into ¼” inch thick matchsticks. To do this cut the potatoes in half…Place the cut potatoes into a large bowl and pat down with a paper towel to absorb any excess moisture. Next add olive oil, truffle oil, garlic, garlic powder and salt to the bowl, toss to combine. Sprinkle parmesan cheese on top and gently toss again.Arrange fries on the two prepared baking sheets so that none of the fries are touching. This will allow them to crisp up while they bake. Spray the top of the french fries with a little olive oil cooking spray (canola also works). Place in oven, baking sheets side by side, and bake for 20 minutes, then flip fries over with a metal spatula and rotate the pans. Bake for 15-20 more minutes and flip again if necessary to brown all sides of the fries.Once fries are nice and golden brown, remove from the oven and allow to cool on baking sheets for 5 minutes. Then drizzle a little extra truffle oil on top and garnish with extra parmesan, cilantro or parsley. Season with additional salt and pepper, if you’d like! Serves with lots of ketchup or your favorite dipping sauce. Serves 4 people."
        ],
        [
            [
                "",
                "Olive oil cooking spray"
            ],
            [
                "",
                "4 medium russet potatoes, washed and patted dry"
            ],
            [
                "",
                "1 1/2 tablespoons olive oil (1 tablespoon will also work)"
            ],
            [
                "",
                "½ tablespoon truffle oil"
            ],
            [
                "",
                "3 cloves garlic, finely minced"
            ],
            [
                "",
                "½ teaspoon garlic powder"
            ],
            [
                "",
                "½ teaspoon sea salt"
            ],
            [
                "",
                "¼ cup Go Veggie! Lactose Free Parmesan"
            ],
            [
                "",
                "For topping:"
            ],
            [
                "",
                "¼ cup chopped cilantro or parsley"
            ],
            [
                "",
                "Extra truffle oil, for drizzling on top"
            ],
            [
                "",
                "Salt and pepper, to taste"
            ]
        ],
        [
            "French Fries",
            " Side Dishes",
            " Dinner",
            " Healthy",
            " Gluten Free",
            " Grain Free"
        ]
    ],
    [
        "Whipped Feta & Avocado Crostini with Pomegranate",
        "Utah has proven to be a true Winter Wonderland thanks to some unexpected snowy weather here.I arrived yesterday to snow dusted roads, slick driving conditions and wonderful steaming cups of hot chocolate. It’s ski weather!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F. Place baguette slices on a large baking sheet and spray with olive oil cooking spray. Rub each slice with raw garlic. Bake for 10-12 minutes or until edges turn a slight golden brown.While crostinis are baking, prepare the whipped avocado feta. Add avocado slices, feta, lime juice and cilantro to a food processor and process until smooth and creamy. If necessary, add a tablespoon of water to thin out the batter. (You want it to be creamy and spreadable, like guacamole.) Add salt and pepper, and process again. Taste and adjust seasonings to your liking. Spoon onto crostini slices, then top with a few pomegrante seeds. Makes 16 crostini."
        ],
        [
            [
                "",
                "2 large avocados, sliced"
            ],
            [
                "",
                "4 oz crumbled feta cheese (goat cheese also works well)"
            ],
            [
                "",
                "2 limes, juiced"
            ],
            [
                "",
                "1/4 cup chopped cilantro"
            ],
            [
                "",
                "salt and pepper, to taste"
            ],
            [
                "",
                "water to thin spread, if necessary"
            ],
            [
                "",
                "1/2 cup pomegranate seeds (from 1 medium pomegranate)"
            ],
            [
                "",
                "1 loaf whole grain french baguette, cut into 1/4 inch thick slices"
            ],
            [
                "",
                "Olive oil cooking spray"
            ],
            [
                "",
                "1 garlic clove, cut in half"
            ]
        ],
        [
            "Christmas",
            " Appetizer",
            " Vegetarian",
            " Healthy"
        ]
    ],
    [
        "Spicy Honey Crispy Baked Chicken Wings + 10 Healthy Football Snacks",
        "As most of you know,I’m really not into sports. I didn’t grow up watching or playing them, so I never really understood the fascination with things like fantasy football.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 275 degrees F. Set a wire rack inside of a foil-lined large rimmed baking sheet. Spray rack with nonstick cooking spray.Pat wings and drummies with a paper towel to dry well. Add chicken to a large plastic bag along with baking powder and salt; close bag and shake to coat wings.Add wings to wire rack and bake for 20 minutes. Then increase oven temp to 425 degrees F and bake for another 30-35 minutes or until wings are crispy and slightly golden.While wings are baking, whisk soy sauce, vinegar, honey, chili paste sriracha and ginger together until well combined. Next add sesame oil to a small saucepan and place over medium heat. Once oil is hot, add in garlic and saute for 30 seconds. Add in soy sauce mixture and simmer over medium low heat for 5 minutes, stirring frequently. This will help thicken and concentrate the sauce. Turn off heat but keep in saucepan until wings are ready.Once wings are done baking, place them in a medium bowl and add in sauce. Toss well to coat the wings. Garnish with sesame seeds and green onions. Drizzle a little extra honey on them if you'd like. Serves 6; 3 wings each."
        ],
        [
            [
                "",
                "2 pounds Just BARE Family Pack Chicken Wingettes and Drumettes"
            ],
            [
                "",
                "2 teaspoons baking powder"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ],
            [
                "",
                "For the sauce:"
            ],
            [
                "",
                "2 tablespoons gluten free soy sauce (or regular)"
            ],
            [
                "",
                "1 tablespoon water"
            ],
            [
                "",
                "1 teaspoon apple cider vinegar"
            ],
            [
                "",
                "1 1/2 tablespoons honey"
            ],
            [
                "",
                "1 tablespoon red chili paste"
            ],
            [
                "",
                "1 teaspoon sriracha"
            ],
            [
                "",
                "1/4 teaspoon ground ginger"
            ],
            [
                "",
                "1/2 teaspoon sesame oil"
            ],
            [
                "",
                "2 cloves garlic, minced"
            ],
            [
                "",
                "sesame seeds, for sprinkling"
            ],
            [
                "",
                "green onions, for garnish"
            ]
        ],
        [
            "Chicken",
            " Poultry",
            " Gluten Free",
            " Appetizer"
        ]
    ],
    [
        "Crispy Supreme Flatbread Quinoa Pizza Crust {gluten free}",
        "Quinoa pizza crust? Yep, it’s a thing. And I have to give Tony credit because he totally came up with the idea.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "First, toast quinoa flour to remove bitter taste: place quinoa flour in a large pot over medium low heat; stir every few minutes with a wooden spoon for 10-15 minutes total, then remove from heat to cool for a few minutes.While quina flour is toasting, place 3/4 cup warm water into bowl a large bowl; stir in yeast and honey. Let stand until yeast begins to foam, about 5 minutes. Add in toasted quinoa flour, flaxseed meal, salt, garlic powder, oregano and thyme; stirring to foam a large dough ball.Remove from bowl and place on a well-floured surface. Knead the dough for 5 minutes until it becomes smooth. You can also do this step in electric mixing bowl by using the hook attachment. Next coat a large bowl with olive oil and add dough, flipping once to coat with oil. Cover bowl with plastic wrap and wait for 30 minutes to an hour.Once ready to bake pizza: Preheat oven to 375 degrees F. Grease a large baking sheet with olive oil.Roll out pizza dough into a large rectangle (about 14x7 inches) on a well-floured surface then place onto prepared pan. Bake pizza dough for 12 minutes. Remove from oven and prepare pizza: Spread pizza sauce over dough, sprinkle on onions, peppers and cheese then add olives, pepperoni and tomatoes on top. Bake for 8-10 more minutes or until cheese is melted and crust is golden brown. Remove from oven and allow to cool for just a few minutes before cutting into 8 slices or squares. I usually enjoy 2 slices for a meal, but it works well as an appetizer too!"
        ],
        [
            [
                "",
                "3/4 cup warm water (about 110-115 degrees F)"
            ],
            [
                "",
                "2 1/4 teaspoons yeast"
            ],
            [
                "",
                "2 teaspoons honey"
            ],
            [
                "",
                "1 tablespoon olive oil"
            ],
            [
                "",
                "2 cups + 2 tablespoons Ancient Harvest Organic Quinoa Flour"
            ],
            [
                "",
                "1 tablespoon flaxseed meal"
            ],
            [
                "",
                "3/4 teaspoon sea salt"
            ],
            [
                "",
                "1 teaspoon garlic powder"
            ],
            [
                "",
                "1/2 teaspoon dried oregano"
            ],
            [
                "",
                "1/2 teaspoon dried thyme"
            ],
            [
                "",
                "For the toppings (based on how I made it)"
            ],
            [
                "",
                "1/3 cup pizza sauce"
            ],
            [
                "",
                "1/4 cup diced onion"
            ],
            [
                "",
                "1/2 green bell pepper, diced"
            ],
            [
                "",
                "3/4 cup shredded mozzarella"
            ],
            [
                "",
                "10 slices turkey pepperoni"
            ],
            [
                "",
                "1/2 cup sliced grape tomatoes"
            ],
            [
                "",
                "For garnishing: crushed red pepper flakes, basil, and parmesan"
            ]
        ],
        [
            "Gluten Free",
            " Pizza",
            " Healthy",
            " Vegan-Friendly"
        ]
    ],
    [
        "Parmesan Garlic Baked Sweet Potato Chips",
        "What’s your favorite kind of chip?",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place sweet potato rounds in a medium bowl and just enough cold water so that they are fully covered. Let the sweet potato rounds soak for 20 minutes. Drain water from sweet potatoes and pat dry with a paper towel.Preheat oven to 325 degrees F. Line two baking sheets with foil and spray with nonstick cooking spray.Add sweet potato rounds, cornstarch, olive oil, garlic powder, sea salt and GO Veggie! Parm Topping to the bag. Shake vigorously and massage so that the sweet potatoes are fully coated.Next evenly divide the rounds between the prepared baking sheets. Do not allow the rounds to touch. Bake for 15 minutes then rotate the pans and flip the chips. Bake another 10 minutes, rotate the pans again and flip once more. Repeat one more time (bake 10 minutes, flip chips). Once chips are browned and edges look a little crispy, they are done. They will crisp up more once they cool. Sprinkle with extra sea salt if desired. Makes 4 servings. Chips are best the day they are first made, as that's when they are the most crispy."
        ],
        [
            [
                "",
                "2 medium sweet potatoes, cut into 1/8th inch rounds"
            ],
            [
                "",
                "2 teaspoons cornstarch (can also use potato starch)"
            ],
            [
                "",
                "1 tablespoon olive oil"
            ],
            [
                "",
                "1/2 teaspoon garlic powder"
            ],
            [
                "",
                "1/4 teaspoon sea salt"
            ],
            [
                "",
                "2 tablespoons GO Veggie! Dairy Free Parmesan Grated Topping"
            ]
        ],
        [
            "Snack",
            " Appetizer",
            " Vegetarian",
            " Dairy Free"
        ]
    ],
    [
        "Low Carb Pesto & Turkey Cucumber Roll Ups",
        "I’m in the midst of looking for a new apartmentin Chicago, mostly becauseI’d like to have an office instead of working in my dining room on a daily basis.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Slice the cucumbers lengthwise on a mandoline at about a 2mm setting. If you don’t have a mandoline, you can always use a vegetable peeler. Place the cucumber slices on parchment paper and pat dry with a paper towel.Spread about 1 teaspoon of pesto on each cucumber, then evenly distribute cheese, turkey, bell pepper and spinach on each. Sprinkle with a little salt and black pepper. Roll up and place seam down. If you want an even nicer presentation, you can stick a toothpick in the middle for easy appetizers! Serve with extra pesto or sauce of choice. Makes about 18 rolls."
        ],
        [
            [
                "",
                "3 medium cucumbers (each will yield about 6 slices)"
            ],
            [
                "",
                "¼ cup store-bought basil pesto"
            ],
            [
                "",
                "6 slices GO Veggie Lactose & Soy Free Mozzarella Slices, cut into ½ inch strips"
            ],
            [
                "",
                "6 oz deli smoked turkey breast, shredded"
            ],
            [
                "",
                "1 bell pepper, thinly sliced into matchsticks"
            ],
            [
                "",
                "1/2 cup spinach, shredded"
            ],
            [
                "",
                "salt and pepper, for seasoning"
            ]
        ],
        [
            "Gluten Free",
            " Grain Free",
            " Appetizer",
            " Snack",
            " Healthy",
            " Low Carb"
        ]
    ],
    [
        "How to Make Lightened-Up Pesto: A Recipe for Creamy Avocado Basil Pesto",
        "When I was little, my mom used to make pesto pasta for me all the time. In fact we had it so frequently that I grew to dislike it quite a bit. I know you’re probably wondering how that’s even possible, but it’s true. As I grew older I could never get back into it either until about a few weeks ago whenI finally tried pesto again.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Add basil, avocado, garlic, pine nuts and lemon juice to a food processor and pulse for 20 seconds or until pesto is chopped. Add in water and process again until completely smooth. You may need to add more water to get it to your desired consistency; I like mine a little on the thicker side. Transfer to a bowl and stir in the cheese.Store in an airtight container or sealed mason jar and refrigerate. Pesto is best if used within a few days, otherwise you can freeze it for several months."
        ],
        [
            [
                "",
                "1 cup packed fresh basil leaves"
            ],
            [
                "",
                "1/2 large ripe avocado"
            ],
            [
                "",
                "2 cloves garlic"
            ],
            [
                "",
                "2 tablespoons pine nuts"
            ],
            [
                "",
                "1 tablespoon fresh lemon juice"
            ],
            [
                "",
                "3 tablespoons water, plus more if necessary"
            ],
            [
                "",
                "1/4 cup grated parmesan cheese"
            ],
            [
                "",
                "sea salt, to taste"
            ]
        ],
        [
            "Condiments",
            " Sauce"
        ]
    ],
    [
        "Chocolate Drizzled Bacon Peanut Butter Caramel Corn {no corn syrup!}",
        "I know today is supposed to be Wellness Wednesday, but I’m taking a small break until the New Year. No worries — I’ll be back next week with a new WW post; I know I’ve been away for a while! I’m guessing we all probably have. This year is such a wonderful time to just kick up your feet, read a new book, and just enjoy family time. And basically every cookie in sight.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Pop your popcorn with whatever method you choose. You can use low fat microwave popcorn or air popped popcorn. Place half of the popcorn in a large bowl.In a saucepan heat honey, brown sugar and coconut oil on medium until all of it is melted and sugar is dissolved. Add baking soda, vanilla and peanut butter and stir for 30 seconds or until mixture is warm. Stir in bacon pieces. Turn off heat and pour half of the caramel sauce on popcorn in pan. Add the rest of the popcorn and peanut butter caramel sauce and fold popcorn over until it is mostly coated with sauce.Sprinkle sea salt over caramel popcorn and again fold over.Immediately remove popcorn from baking pan and spread evenly on wax paper. If you choose to do the chocolate drizzle: Place the chocolate chips and coconut oil in a microwave safe dish for 20-30 seconds, stirring until chips are all melted. Drizzle melted chocolate all over caramel corn and allow to harden for 20 minutes. You can place the popcorn in the refrigerator for a few minutes to help harden the chocolate a bit. Popcorn is good for 3-4 days stored at room temperature in a container or plastic bag. Serves 8. About 1 cup per serving."
        ],
        [
            [
                "",
                "8-10 cups air popped popcorn*"
            ],
            [
                "",
                "3 tablespoons honey"
            ],
            [
                "",
                "1/3 cup brown sugar"
            ],
            [
                "",
                "1 tablespoon coconut oil"
            ],
            [
                "",
                "1/4 teaspoon baking soda"
            ],
            [
                "",
                "1 teaspoon vanilla"
            ],
            [
                "",
                "1/2 cup all natural peanut butter (or almond butter)"
            ],
            [
                "",
                "4 pieces cooked bacon, cooked and finely chopped"
            ],
            [
                "",
                "1/4 teaspoon sea salt, plus more to taste"
            ],
            [
                "",
                "For the drizzle:"
            ],
            [
                "",
                "2 tablespoons chocolate chips"
            ],
            [
                "",
                "1 teaspoon coconut oil"
            ]
        ],
        [
            "Snack",
            " Appetizer",
            " Gluten free"
        ]
    ],
    [
        "Black Bean, Corn and Quinoa Enchilada Bake (or dip!)",
        "Quinoa enchilada bake is a delicious appetizer or dinner! Best of all it’s made with an easy homemade enchilada sauce!",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Place 1 cup of water and 1/2 cup quinoa in a small saucepan and place over high heat. Bring to a boil, then reduce heat to low, cover and simmer for 15 minutes. Remove from heat and fluff quinoa with fork.Preheat oven to 350 degrees F.To make homemade enchilada sauce:In a medium saucepan or skillet, heat olive oil over medium high heat. Add in onions and cook, stirring frequently until they become translucent, about 5 mins. Add in garlic, chili powder, cumin, salt and oregano and cook for 30 more seconds. Add in tomato sauce and water; stir well to combine. Reduce heat to medium-low and simmer sauce for 10 minutes.While sauce is simmering, add drained fire-roasted tomatoes, black beans, corn, cooked quinoa and cilantro to a large bowl. Next, add in your homemade enchilada sauce and 1/2 cup of shredded cheese. Pour into a 2-quart oven-safe casserole dish. Sprinkle remaining cheese over the top. Bake for 15-20 minutes or until cheese on top is completely melted and the filling is bubbling.Recipe makes 6 servings as a dish. If this is for entertaining, the recipe will serve 10-12."
        ],
        [
            [
                "",
                "½ cup uncooked quinoa"
            ],
            [
                "",
                "1 teaspoon olive oil"
            ],
            [
                "",
                "1 yellow onion, chopped"
            ],
            [
                "",
                "3 cloves garlic"
            ],
            [
                "",
                "3 tablespoons chili powder"
            ],
            [
                "",
                "1 teaspoon cumin"
            ],
            [
                "",
                "1/4 teaspoon salt, plus more to taste"
            ],
            [
                "",
                "1/2 teaspoon dried oregano"
            ],
            [
                "",
                "1 (15 oz) can Muir Glen organic tomato sauce"
            ],
            [
                "",
                "3/4 cup water"
            ],
            [
                "",
                "1 (15 oz) can Muir Glen organic fire-roasted diced tomatoes, drained"
            ],
            [
                "",
                "1 (15 ounce) can black beans, rinsed and drained"
            ],
            [
                "",
                "1 (15 ounce) can sweet corn, drained"
            ],
            [
                "",
                "1/4 cup finely chopped cilantro, plus extra for garnish"
            ],
            [
                "",
                "1 1/2 cups of shredded colby jack or mexican cheese"
            ]
        ],
        [
            "Gluten Free",
            " Entertaining",
            " Healthy"
        ]
    ],
    [
        "Butternut Squash Quinoa Patties with Cranberry Orange Sauce",
        "I’m back in Minnesota this week enjoying some time with my Mom. She’s making me pour over coffee right now. Outside the trees are bare, the wind is cold and well,basically it’s freezing. But alas, this is where I grew up and I’m happy to be spending time with her.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "First cook the cranberry orange sauce: Combine cranberries, orange juice, maple syrup and bourbon in a small saucepan. Turn heat on high until it begins to boil, then reduce to medium low, cover and cook for an additional 10-15 minutes or until the sauce becomes thick. Remove from heat and set aside to cool. You may notice a popping sound; this is the cranberries bursting so don't worry!While the cranberries are cooking, you can cook the quiona: Add 1 cup of water and uncooked quinoa to a small saucepan and place over high heat. Bring to a boil, then reduce to low, cover and cook for 15 minutes. Remove from heat and fluff quinoa with a fork; set aside to cool for a few minutes.To make the patties: In a large bowl, combine mashed butternut squash, quiona, onion, garlic, egg, cumin, parmesan, basil, salt and pepper. Form into 4 patties and place in the fridge for 10 minutes to help keep the patties in their shape. Heat a large skillet over medium heat and generously spray with nonstick cooking spray. Place patties in pan and cook for 4-6 minutes or until golden brown, then flip and cook 4-5 minutes longer or until they have nice crispy golden edges. They may be a little difficult to flip so be careful and make sure they are packed tightly.Serve warm with a few tablespoons of cranberry sauce over the top and extra basil, if desired. Makes 4 patties and a generous amount of sauce."
        ],
        [
            [
                "",
                "1 cup mashed and cooked butternut squash*"
            ],
            [
                "",
                "1/2 cup uncooked quinoa (or 1 cup cooked)"
            ],
            [
                "",
                "1/2 small yellow onion, diced"
            ],
            [
                "",
                "2 cloves garlic, minced"
            ],
            [
                "",
                "1 egg"
            ],
            [
                "",
                "1/4 teaspoon cumin"
            ],
            [
                "",
                "1/4 cup grated parmesan cheese"
            ],
            [
                "",
                "2 tablespoons chopped fresh basil, plus more for garnish"
            ],
            [
                "",
                "salt and pepper"
            ],
            [
                "",
                "For the cranberry sauce:"
            ],
            [
                "",
                "1/2 pound fresh cranberries, rinsed"
            ],
            [
                "",
                "1/2 cup freshly squeezed orange juice"
            ],
            [
                "",
                "3 tablespoons pure maple syrup"
            ],
            [
                "",
                "1 tablespoon bourbon, if desired"
            ],
            [
                "",
                "Nonstick cooking spray"
            ]
        ],
        [
            "Gluten free",
            " Vegetarian",
            " Healthy",
            " Dinner"
        ]
    ],
    [
        "Parmesan and Garlic Baked Sweet Potato Fries",
        "Sometimes I go on a french fry craze. Like get out of my way, I’m going to eat that entire plate of fries because I haven’t had them in nearly a month, and they look pretty dang terrific.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 425 degrees F.Add sweet potato fries to a large bowl, along with half of the olive oil, garlic, salt and Go Veggie! Parmesan Grated Topping. Toss to coat fries.Drizzle 1/2 of olive oil (about 1 ½ teaspoons) over large baking sheet. Place in oven for a few minutes until pan gets hot and oil is shimmering. Remove pan from oven and add sweet potatoes fries, making sure to evenly spread them out over the pan so that none are touching.Place back in oven and bake for 15 minutes, then flip fries and bake again for another 10-15 minutes or until fries become slightly golden brown and begin to crisp up a bit. Taste fries and add additional salt or parmesan if desired. Enjoy immediately! Serves 4."
        ],
        [
            [
                "",
                "4 medium sweet potatoes, peeled and cut into ½ inch sticks"
            ],
            [
                "",
                "1 tablespoon of olive oil, divided"
            ],
            [
                "",
                "2 cloves of garlic, finely minced"
            ],
            [
                "",
                "½ teaspoon sea salt, plus more"
            ],
            [
                "",
                "2 tablespoons"
            ]
        ],
        [
            "French Fries",
            " Vegan"
        ]
    ],
    [
        "Rotisserie Chicken Naan Pizza with Spinach, Queso Fresco, & Fire-Roasted Tomato-Mango Chutney Sauce",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Heat oven to 400˚F. Line a large baking sheet with parchment paper. Mix tomatoes and chutney in a medium saucepan. Bring to a boil; reduce heat and simmer over low heat about 15 minutes or until thickened. Cool 5 minutes.Meanwhile, place naan on prepared baking sheet. Spread sauce over naan. Top with chicken, spinach, and cheese. Season with salt and pepper.Bake 10 to 15 minutes or until edges are golden brown and cheese is melted."
        ],
        [
            [
                "",
                "1 (14-1/2 ounces) can fire-roasted dice tomatoes with juices"
            ],
            [
                "",
                "1/2 cup mango chutney"
            ],
            [
                "",
                "2 (4-1/2 ounces each) whole-grain naan breads"
            ],
            [
                "",
                "1 cup shredded Just BARE® Rotisserie Chicken"
            ],
            [
                "",
                "1 cup fresh baby spinach leaves"
            ],
            [
                "",
                "1 cup (4 ounces) crumbled queso fresco cheese"
            ],
            [
                "",
                "Coarse salt and freshly ground pepper to taste"
            ]
        ],
        [
            "Pizza",
            " Appetizer",
            " Flatbread"
        ]
    ],
    [
        "How to Make the Perfect Party Cheese Platter",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "Summer Berry Crostini with Lemon Ricotta + Honey",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 425 degrees F.In medium bowl, mix together ricotta, lemon juice, a tablespoon of honey, and a pinch of salt. Taste; adjust flavors as necessary. You may want more lemon or honey.Place crostinis on baking sheet and drizzle with olive oil. Sprinkle with a dash of salt. Bake for 10 minutes or until slightly golden brown. Immediately spread ricotta over warm crostinis and place berries on top. Drizzle with a bit more honey. Serve immediately."
        ],
        [
            [
                "",
                "2 demi (petite) multigrain or whole grain french baguettes, cut into about 24 small slices, about 1/4 inch thick"
            ],
            [
                "",
                "1 tablespoon olive oil"
            ],
            [
                "",
                "1 1/2 cups low-fat ricotta"
            ],
            [
                "",
                "2 tablespoons fresh lemon juice"
            ],
            [
                "",
                "1 tablespoon honey, plus extra for drizzling"
            ],
            [
                "",
                "pinch of salt"
            ],
            [
                "",
                "1-2 cups fresh organic summer berries (strawberries, blueberries, cherries, raspberries)"
            ]
        ],
        []
    ],
    [
        "Dark Chocolate, Raspberry, and Brie Grilled Cheese",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Spread butter on one side of each slice of bread.Slice the brie and spread on unbuttered sides of the bread. Add smashed raspberries and broken pieces of chocolate, top with remaining slices of buttered bread.Heat a skillet over medium high heat and add in sandwiches. Cover with a lid and cook about 5 minutes, or until golden brown on bottom.Carefully flip sandwich, reduce heat to medium and cook a few more minutes or until the chocolate and cheese have melted and bread is golden brown. Enjoy sandwiches immediately!"
        ],
        [
            [
                "",
                "4 thick slices of multigrain baguette"
            ],
            [
                "",
                "2 tablespoons butter"
            ],
            [
                "",
                "4 ounces Brie Cheese"
            ],
            [
                "",
                "2 ounces your favorite good-quality dark chocolate, broken into pieces"
            ],
            [
                "",
                "½ cup smashed raspberries (about ¼ pint)"
            ]
        ],
        []
    ],
    [
        "Cinnamon-Sugar Sweet Potato Fries with Brown Butter Marshmallow Glaze",
        "So this weekend I shoveled snow in my heels because I didn’t have any boots with me. It was completely ridiculous but also a little riveting as it proves I’m a total badass. Call me Beyonce.",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Thaw out sweet potato fries for 10 minutes and place into a large bowl. Add cinnamon and sugar to bowl and use your hand to toss sweet potato fries. Bake according to directions on the package.While fries are baking, prepare the glaze: In a medium bowl whisk together marshmallow creme, greek yogurt, and salt together; set aside. Melt butter in a small saucepan over medium-high heat. The butter will begin to foam. Make sure you whisk consistently during this process. After a couple of minutes, the butter will begin to brown on the bottom of the saucepan; continue to whisk and remove from heat as soon as the butter begins to brown and give off a nutty aroma. Set aside to cool for a few minutes then whisk into the marshmallow creme until well combined.Once the fries are done baking, drizzle the brown butter marshmallow glaze over the fries. Alternatively you can also use the glaze as a dip since there will be a significant amount of it."
        ],
        [
            [
                "",
                "1 package Alexia Sweet Potato Fries (or your own sweet potato fries)"
            ],
            [
                "",
                "1 teaspoon cinnamon"
            ],
            [
                "",
                "1 tablespoon sugar"
            ],
            [
                "",
                "2/3 cup marshmallow creme"
            ],
            [
                "",
                "1/4 cup plain nonfat greek yogurt"
            ],
            [
                "",
                "4 tablespoons unsalted butter"
            ],
            [
                "",
                "1/4 teaspoon salt"
            ]
        ],
        []
    ],
    [
        "Garlic White Bean Basil Hummus",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 375 degrees F.Cut each pita into 8 wedges. and place wedges in a large bowl. Drizzle with 1 tablespoon of olive oil or spray with olive oil cooking spray and gently toss to coat. Sprinkle 1 teaspoon salt all over wedges adding other spices if desired; toss again to coat.Arrange on an ungreased baking sheet and bake about 8-10 minutes, until pita chips are golden brown. Flip over once halfway through baking. Cool on pans.Meanwhile to make your hummus: combine beans, garlic, lemon juice, basil, salt and pepper in the bowl of a food processor. Pulse a couple of times until the mixture looks somewhat chopped. Add in the 2 tablespoons of olive oil while the machine is still running. Let process until the mixture is creamy.If the mixture appears to be too thick, add in a few teaspoons of water at a time to thin it out. Otherwise, season with additional salt and pepper to your liking and drizzle the top with a tiny bit of olive oil."
        ],
        [
            [
                "",
                "1 (15 ounce) can of cannellini beans, drained and rinsed"
            ],
            [
                "",
                "4 cloves of garlic"
            ],
            [
                "",
                "2 tablespoons fresh lemon juice"
            ],
            [
                "",
                "1/2 teaspoon salt"
            ],
            [
                "",
                "1/2 teaspoon freshly ground black pepper"
            ],
            [
                "",
                "4-6 large basil leaves"
            ],
            [
                "",
                "3 tablespoons olive oil, plus extra for drizzling on top"
            ],
            [
                "",
                "Water to thin, if necessary"
            ]
        ],
        [
            "Snack",
            " Appetizer"
        ]
    ],
    [
        "Roasted Grape & Brie Crostini with Honey + Sea Salt",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 400 degrees F. Place grapes on a nonstick baking sheet and drizzle with 1 teaspoon of olive oil. Toss to coat grapes evenly and roast for about 15 minutes or until grapes begin to look like they might burst and shrivel a bit. Set grapes aside to cool. Keep oven temperature.Place bread on separate baking sheet and brush each half with remaining 1 teaspoon of olive oil. Top each with brie cheese slices and bake for 10 minutes. Turn oven to broil and broil for 30-45 seconds until cheese melts and bubbles. Add grapes on top of cheese and drizzle honey all over. Sprinkle with a bit of sea salt. Cut bread into wedges and serve."
        ],
        [
            [
                "",
                "2 cups seedless red grapes"
            ],
            [
                "",
                "2 teaspoons olive oil, divided"
            ],
            [
                "",
                "1 whole grain demi french baguette found at Trader Joe's or about 1/2 a loaf of french baguette, sliced in half, lengthwise"
            ],
            [
                "",
                "4-6 ounces of brie cheese, thinly sliced"
            ],
            [
                "",
                "Honey, for drizzling"
            ],
            [
                "",
                "coarse sea salt, for sprinkling"
            ]
        ],
        [
            "Snack",
            " Appetizer"
        ]
    ],
    [
        "Smashed Avocado + Tomato Basil Bruschetta",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven on broiler setting.Place slices of bread on baking sheet, spray with olive oil cooking spray and sprinkle with sea salt; broil slices in oven about 2 minutes on each side or until golden brown. Remove from oven and rub with one clove of garlic (make sure to cut it in half before rubbing).In a medium bowl, mix smashed avocado, lime juice, and 1/4 teaspoon of sea salt and ground pepper.In a separate large bowl, combine tomatoes, olive oil, and balsamic vinegar. Mince other garlic clove and add it into tomato mixture.Spread smashed avocado mixture onto each slice of toast, then generously spoon tomato topping on top. Garnish with basil and serve immediately."
        ],
        [
            [
                "",
                "Cooking spray"
            ],
            [
                "",
                "1/2 loaf whole grain french bread (or 1 petite loaf), sliced 1/2 inch thick"
            ],
            [
                "",
                "2 avocados, smashed"
            ],
            [
                "",
                "1 tablespoon fresh lime juice"
            ],
            [
                "",
                "1/4 teaspoon sea salt, plus exta"
            ],
            [
                "",
                "1/4 teaspoon freshly ground black pepper"
            ],
            [
                "",
                "4 large roma tomatoes, chopped"
            ],
            [
                "",
                "2 cloves garlic"
            ],
            [
                "",
                "2 Tablespoons olive oil"
            ],
            [
                "",
                "1 tablespoon balsamic vinegar"
            ],
            [
                "",
                "3-4 basil leaves, chopped"
            ]
        ],
        [
            "Appetizer",
            " Lunch",
            " Healthy"
        ]
    ],
    [
        "Roasted Balsamic Strawberry Cherry Pita Pizzas with Arugula",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "Baked Sweet Potato Fries with Homemade Honey Mustard Dipping Sauce",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "Dark Chocolate Salted Caramel Corn + an awesome playlist",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [],
        [],
        []
    ],
    [
        "Spicy Sweet Potato Fries with Blueberry Ketchup",
        "",
        0,
        0,
        0,
        0,
        0,
        0,
        [
            "Preheat oven to 425 degrees F and spray pan with non stick cooking spray.Cut sweet potatoes to resemble French fries.Combine sweet potato strips, salt, olive oil, cumin, and chili powder in bowl. Toss with hands so sweet potatoes are fully coated.Place potato strips on pan.Bake for 15 minutes, then stir and bake another 15 minutes or until fries are crispy and golden.Serves 4"
        ],
        [
            [
                "",
                "4 Medium Sweet Potatoes"
            ],
            [
                "",
                "1 tablespoon of olive oil"
            ],
            [
                "",
                "1 teaspoon of salt"
            ],
            [
                "",
                "¼ teaspoon of cumin"
            ],
            [
                "",
                "¼ teaspoon of chili powder"
            ]
        ],
        [
            "Side Dish",
            " Vegetarian",
            " Vegan",
            " Gluten Free"
        ]
    ]
]